{
	"dish": [
		[
			"TURKEY CHILES RELLENOS",
			"TURKEY",
			"The bell pepper's sweetness and the turkey and tomato's savory elements combine with rice to make something both satisfying and filling",
			"2 tablespoons Vegetable Stock Concentrate, 2 Poblano Peppers, 1/2 Cup Jasmine Rice, 1 Yellow Onion, 1 Jalapeño, 1 Tablespoon Southwest Spice Blend, 10 oz Ground Turkey, 8 oz Box Crushed Tomatoes, 1 Tablespoon Chipotle Powder, 1/2 Cup Monterey Jack Cheese, Table Salt, Pepper, 2 Teaspoons of Oil, 3/4 Cup of Water, 1/3rd Cup of Water",
			"2 Small Pots with Pot Lid, Baking Sheet, Large Oven-Proof Pan (Alternatively, if you don't have one, a regular Large Pan and a Small Baking Dish), Knife, Cutting Board, Wooden Spoon, Oven",
			"STEP 1. Wash and dry all produce. Adjust rack to middle position and preheat oven to 425 degrees. Bring 3/4 cup water and 1 tablespoon stock concentrate to a boil in a small pot. Halve poblanos lengthwise, removing cores and seeds. Rub with a drizzle of oil. Season with salt and pepper. Roast on a baking sheet until soft, about 20 minutes",
			"STEP 2. Once stock boils, add rice to pot. Cover, lower heat, and reduce to a gentle simmer. Cook until tender, about 15 minutes. Meanwhile, half, peel, and dice onion. Finely chop jalapeño, removing ribs and seeds for less heat.",
			"STEP 3. Heat a drizzle of oil in a large pan over medium heat. Add onion and jalapeño (to taste). Cook, tossing, until soft, 4-5 minutes. Add 2 teaspoons of southwest spice and turkey, breaking up meat. Cook, tossing, until no longer pink, 4-5 minutes. Season with salt and pepper. Remove from heat.",
			"STEP 4. In another small pot, stir together the crushed tomatoes, remaining stock concentrate, 1/3 cup of water, remaining southwest spice, and as much chipotle powder as you like (start with a pinch and go up from there). Season with salt and pepper. Place over medium-low heat and bring to a gentle simmer.",
			"STEP 5. Once rice is done cooking, add to pan with filling. Toss to combine. Season with salt and pepper, and any remaining chipotle powder, if desired. (TIP: If your pan is not ovenproof, transfer mixture to a small baking dish at this point.) Stuff poblanos with as much filling as will fit. Place in same pan (or baking dish), nestling in remaining unused filling.",
			"STEP 6. Drizzle sauce over stuffed poblanos. Sprinkle with cheese. Bake in oven until cheese melts, 2-3 minutes. Divide stuffed poblanos and filling from pan between plates and serve."
		],
		[
			"PESTO TURKEY BURGERS",
			"TURKEY",
			"Herby, Italian-style flavor is mixed right into the meat of these hefty patties.",
			"1 tablespoon Olive Oil, 1 tablespoon Butter, 2 Carrots, 10 oz Ground Turkey, 2 oz Pesto, 1/2 cup Mozzarella Cheese, 2 tablespoon Mayonnaise, 1 Lemon, 2 Brioche Buns, 1 Beefsteak Tomato, salt, pepper",
			"Peeler, Small Bowl, Large Baking Sheet, Zester, 2 Medium Bowls, Medium Pan with lid (if you don't have a lid use tin foil), Wooden Stirring Spoon, Oven, 1 teaspoon Measure Spoon",
			"STEP 1. Wash and dry all produce. Adjust rack to middle position and preheat oven to 425 degrees. Peel carrots, then cut on a slight diagonal into 1/2-inch-thick slices. Toss on a baking sheet with 1 tablespoon olive oil. Season with salt and pepper. Roast in oven until tender, 15-20 minutes.",
			"STEP 2. Mix together turkey, 2 tablespoon pesto (we'll use the rest later), and a large pinch of salt and pepper in a medium bowl. Shape into two 4-inch-wide patties. Melt 1 tablespoon of butter in a medium pan over medium heat. Add patties and cook until nicely browned on bottom, about 6 minutes.",
			"STEP 3. Once patties are browned on bottom, flip and cook on other side for 3 minutes. Sprinkle mozzarella evenly onto each, then cover pan and continue cooking until cheese is melted and burgers are cooked through, 2-3 minutes more. (TIP: If your pan doesn't have a lid, use aluminum foil to cover it.",
			"STEP 4. Place mayonnaise and remaining pesto in a small bowl and stir to combine.",
			"STEP 5. Zest lemon, until you have 1 teaspoon zest, then halve lemon. Once carrots are done roasting, place in another medium bowl along with lemon zest, a squeeze of lemon juice, and pepper (to taste). Toss to coat carrots.",
			"STEP 6. Split buns in half and place cut-side down on a baking sheet used for carrots. Place in oven and allow to warm through, about 2 minutes. Meanwhile, slice tomato into rounds. Spread as much pesto mayo as you like on the cut side of the bun bottoms, then top each with a turkey patty, tomato rounds, and bun top. Serve with carrots on the side."
		],
		[
			"BARBECUE TURKEY BURGERS",
			"TURKEY",
			"Bold spices meet a dash of sugar to create that signature barbecue flavor.",
			"4 tablespoon of Sour Cream, 12 oz Yukon Gold Potatoes, 2 Scallions, 1 Roma Tomato, 1 Dill Pickle, 1 Thai Chili, 1 tablespoon Sweet and Smoky Barbecue Seasoning, 10 oz Ground Turkey, 4 tablespoon Ketchup, 2 Brioche Buns, 1/2 cup Cheddar Cheese, Table Salt, Pepper, 2 teaspoon Vegetable Oil, 2 tablespoon Butter, 2 tablespoon Water",
			"Baking Sheet, Medium Bowl, Medium Pan, Oven, Cutting Board, Knife, Spatula, Wooden Stirring Spoon, Toaster",
			"STEP 1. Wash and dry all produce. Adjust rack to upper position and preheat oven to 450 degrees. Set aside sour cream at room temperature. Cut potatoes into 1/2-inch-thick wedges. Trim, then thinly slice scallions, separating greens and whites. Slice tomato and pickle into thin rounds. Mince chili, removing ribs and seeds first for less heat.",
			"STEP 2. Toss potatoes on a baking sheet with a drizzle of oil. Season with salt, pepper, and 1 and 1/2 teaspoon barbecue seasoning (we'll use the rest in the next step). Roast in oven until tender and crisped, 20-25 minutes, flipping halfway through.",
			"STEP 3. In a medium bowl, combine turkey with remaining barbecue seasoning and 1 teaspoon ketchup (save the rest for spreading on the buns). Season turkey mixture with salt and pepper (we used 1 teaspoon kosher salt). Shape into two 3/4-inch-thick patties.",
			"STEP 4. Heat a drizzle of oil in a medium pan over medium-high heat (use a nonstick pan if you have one). Add patties and cook until no longer pink in center, 4-6 minutes per side. (TIP: Lower heat to medium and cover pan if patties are browned before meat cooks through.) Meanwhile, split buns in half and toast in oven or toaster until light golden, 2-3 minutes. Transfer patties to a plate to rest once done. Wipe out pan.",
			"STEP 5. Melt 2 tablespoons of butter in pan used for patties over medium-high heat. Add scallion whites and cook, tossing, until just softened, 1-2 minutes. Pour in 2 tablespoons of water and bring to a simmer. Remove pan from heat and whisk in cheddar and sour cream until smooth and well-combined. Season with salt and pepper. TIP: If queso thickens before serving, warm over low heat, stirring constantly.",
			"STEP 6. Spread bun bottoms with rest of ketchup, then place patties on each and spoon a little queso over. Top with pickle, tomato slices, and remaining bun halves. Divide between plates with potatoes to the side. Drizzle remaining queso over potatoes. Garnish with scallion greens and chili (to taste)."
		],
		[
			"ROASTED BELL PEPPER FLATBREADS",
			"VEGETARIAN",
			"A quick and easy zesty flat bread recipe.",
			"2 Flatbreads, 1/4 cup of Tomato Paste, 1/2 tablespoon of Tuscan Heat Spice, 2 tablespoons Cream Cheese, 1 Bell Pepper, Shredded Mozzarella Cheese, 1 Shallot, 1 Clove of Garlic, 4 teaspoons of Olive Oil, 1 tablespoon of Butter, Table Salt, Black pepper, 1/3 cup of Water",
			"Oven, Stove, Knife, Cutting Board, 2 Large Baking Sheets, Wooden Stirring Spoon, Measuring Cup, Pizza Cutter",
			"STEP 1. Adjust racks to top and middle positions and preheat oven to 450 degrees. Wash and dry all produce. Halve, peel, and thinly slice shallot into wedges. Halve, core, and thinly slice bell pepper into strips. Peel and finely chop garlic.",
			"STEP 2. Toss bell pepper and shallot on a baking sheet with a large drizzle of olive oil and half the tuscan heat spice (you'll use the rest later). Season with salt and pepper. Roast on top rack until softened and lightly browned, 13-15 minutes.",
			"STEP 3. While veggies roast, rub tops of flatbreads with a large drizzle of olive oil. Place on a second baking sheet and roast on middle rack until golden and crispy at the edges, 5-7 minutes.",
			"STEP 4. Meanwhile, melt 1 tablespoon of butter in a medium pan over medium-high heat. Add garlic and remaining tuscan heat spice; cook until fragrant, 1 minute. Add tomato paste and stir to coat. Stir in 1/3 cup of water and cream cheese until combined. Bring to a simmer and cook until thickened, 2-3 minutes. Remove from heat and season with salt and pepper.",
			"STEP 5. Once flatbreads are golden, remove from oven. Spread with sauce and top with roasted veggies and cheese. Return flatbreads to oven and bake until cheese melts, 3-5 minutes more.",
			"STEP 6. Slice flatbreads into pieces with pizza cutter and serve."
		],
		[
			"SWEET POTATO AND PEPPER QUESADILLAS",
			"VEGETARIAN",
			"A dish that proves vegetarian isn’t just salad. This combination of zesty and hearty flavors is as filling as it is satisfying.",
			"1 Sweet Potato, 1 Yellow Onion, 1 Long Green Pepper, 1/2 teaspoon of Chipotle Powder, 1 Lime, 1 Clove of Garlic, 1 Roma Tomato, 1 Jalapeño, 4 tablespoons of Sour Cream, 2 large Flour Tortillas, Shredded Pepper Jack Cheese, 1 tablespoon of Vegetable Oil, Table Salt, Black Pepper",
			"Oven, Broiler, 1 Large Baking Sheet, Knife, Cutting Board, 2 Small Bowls, Wooden Stirring Spoon, spatula",
	 		"STEP 1. Preheat oven to 450 degrees. Wash and dry all produce. Dice sweet potato into 1/2-inch pieces. Halve, peel, and thinly slice onion; mince a few slices until you have 1 tablespoon. Halve, core, and thinly slice green pepper crosswise into strips. Toss sweet potato on a baking sheet with a drizzle of oil, salt, and pepper, and a pinch of chipotle powder to taste (add more if you like things spicy). Roast until slightly softened, 12 minutes (we’ll add the rest of the veggies then.)",
	 		"STEP 2. Meanwhile, halve lime. Peel and finely chop garlic. Dice tomato. Finely chop jalapeño, removing ribs and seeds if you prefer less heat. In a small bowl, combine tomato, minced onion, juice from half the lime, and as much jalapeño as you’d like (save some for stuffing the quesadillas). Season with salt and pepper.",
	 		"STEP 3. In a second small bowl, combine sour cream, a squeeze of lime juice, a pinch of garlic, and a pinch of chipotle powder to taste. Season with salt and pepper. Taste and add more garlic and chipotle powder if desired.",
	 		"STEP 4. Once sweet potato has roasted 12 minutes remove baking sheet from oven. Add green pepper and sliced onion to same sheet; carefully toss with a drizzle of oil, salt, and pepper. Return to oven until veggies are browned and tender, 10-15 minutes more. Transfer veggies to a plate. Heat broiler to high.",
	 		"STEP 5. Rub one side of each tortilla with a drizzle of oil; place oiled sides down on baking sheet used for veggies. Evenly sprinkle one half of each tortilla with cheese. Top cheese with veggies and as much remaining jalapeño as you’d like; fold tortillas over to create quesadillas.",
	 		"STEP 6. Broil quesadillas, flipping halfway through, until cheese has melted and tortillas are lightly browned, 1-2 minutes per side. (Watch out for burning. The broiler is a powerful tool!) Cut each quesadilla into three triangles, divide between plates. Serve with salsa and crema."
		],
		[
			"CREAMY ROASTED TOMATO SOUP",
			"VEGETARIAN",
			"Served with a side of pepper jack grilled cheese sandwiches this dish is both savory and filling.",
			"1 Roma Tomato, 2 Cloves of Garlic, 1 Yellow Onion, 1/2 cup Shredded Pepper Jack Cheese, 4 Slices of Sourdough Bread, 8 oz of Crushed Tomatoes, 1 Tablespoon of Vegetable Stock Concentrate, 2 tablespoons of Cream Cheese, Salt, Pepper, 1/2 teaspoon of Sugar, 3 tablespoons of Butter, 1 tablespoon of Olive Oil, 1 cup of Water",
			"Oven, Cutting Board, Knife, Small Microwave-Safe Bowl (for butter), Baking Sheet, Tin Foil, Medium Pot, Large Pan, Wooden Stirring Spoon, Spatula",
			"STEP 1. Preheat Oven to 375 degrees. Bring 3 tablespoons of butter to room temperature. Line a baking sheet with foil. Wash and dry all produce. Halve tomato lengthwise; cut into 1/2-inch-thick wedges. Peel garlic; place cloves in the center of a small piece of tin foil. Cinch into a packet. Halve, peel, and finely chop onion until you have 1/2 cup.",
			"STEP 2. Toss tomato on prepared sheet with a large drizzle of olive oil and a pinch of salt and pepper. Place garlic foil packet on same sheet. Roast until tomato and garlic are browned and softened, 18-20 minutes.",
			"STEP 3. Meanwhile, heat a drizzle of olive oil in a medium pot over medium heat. Add onion and a pinch of salt and pepper. Cook, stirring, until softened, 5-6 minutes. Stir in crushed tomatoes, stock concentrate, and 1 cup of water. Bring to a boil and cook, stirring occasionally, until thickened, 8-12 minutes. Reduce heat to low.",
			"STEP 4. While soup simmers, evenly divide pepper jack cheese between bread to create sandwiches. If butter is not yet softened, place in a small microwave-safe bowl; microwave for 5-10 seconds. Spread outsides of sandwiches with softened butter.",
			"STEP 5. Heat a large, dry pan over medium heat. Add sandwiches and cook until bread is browned and cheese has melted, 4-6 minutes per side. Turn off heat. Transfer sandwiches to a cutting board; halve on a diagonal. Carefully transfer roasted tomato and garlic to cutting board; finely chop.",
			"STEP 6. Stir chopped tomato and garlic, cream cheese, and 1/2 teaspoon sugar into soup. Taste and season with salt, pepper, and/or another pinch of sugar. Serve sandwiches with soup on the side."
		],
		[
			"GARDEN VEGGIE MELTS",
			"VEGETARIAN",
			"A zesty and sweet sandwich with a side of sweet potato rounds. If the meat lover in your life thinks the 'vegetarian' and 'tasteless' are interchangeable show why they're wrong with this staple.",
			"2 Sweet Potatoes, 1 Zucchini, 1 Roma Tomato, 8 oz Fresh Mozzarella, 1 Clove of Garlic, 4 Slices of Sourdough Bread, 1/2 cup Shredded Monterey Jack Cheese, 2 tablespoons of Butter, 1 tablespoon of Olive Oil, Ketchup (optionally), Table Salt, Pepper, ",
			"Oven, Cutting Board, Knife, Small Microwave-Safe Bowl(for butter), Medium Bowl, Large Baking Sheet, Large Pan, Plate, Spatula, Wooden Stirring Spoon",
			"STEP 1. Preheat oven to 425 degrees. Bring 2 tablespoons of butter to room temperature. Wash and dry all produce. Slice sweet potatoes into 1/4-inch-thick rounds. Trim and halve zucchini crosswise; cut each half lengthwise into 1/4-inch-thick planks. Slice tomato into rounds. Thinly slice mozzarella.",
			"STEP 2. Toss zucchini and tomato in a medium bowl with a large drizzle of olive oil, salt, and pepper; set aside. Toss sweet potatoes on a baking sheet with a drizzle of olive oil, salt, and pepper. Roast until browned and tender, 20-25 minutes. (Check on them after 20 minutes. To test for doneness, prick one piece with a fork - it should go through easily.)",
			"STEP 3. Meanwhile, heat a large pan over high heat (use a grill pan if you have one). Pick out zucchini from bowl and add to pan in a single layer. Cook until tender and lightly charred, 2-5 minutes per side. Transfer to a plate. Add tomato in a single layer. Cook until lightly charred, 1 minute per side. Turn off heat; set aside with zucchini. Wash out pan.",
			"STEP 4. While veggies cook, peel and halve garlic clove; rub all over bread. Once veggies are done, assemble sandwiches: evenly top half the bread with Monterey Jack Cheese, zucchini, tomato, and mozzarella (Add each veggie in a single layer and don't overstuff. If you have some left over, serve on the side) Top with remaining bread, then spread outsides of sandwiches with softened butter. (If butter is still cold, microwave for 5-10 seconds.)",
			"STEP 5. Heat pan used for veggies over medium heat. Add sandwiches; cook, pressing down occasionally with a spatula, until bread is golden brown and cheese melts, 4-6 minutes per side. Transfer to a cutting board. Let cool slightly, then halve on a diagonal.",
			"STEP 6. Divided sandwiches between plates. Serve with sweet potato rounds and, if you've got some on hand, ketchup on the side for dipping."
		],
		[
			"PEAR & BALSAMIC ONION FLATBREADS",
			"VEGETARIAN",
			"Sweet and spicy mix together for a dish that's as fancy looking as it is delicious.",
			"1 Red Onion, 1 Bartlett Pear, 4 oz Fresh Mozzarella, 5 teaspoons of Balsamic Vinegar, 2 Flatbreads, 1 teaspoon of Chili Flakes, 2 oz Spring Mix Lettuce, 7 teaspoon Olive Oil, 1 teaspoon Vegetable Oil, 1 teaspoon Sugar, Salt, Pepper",
			"Oven, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Large Pan, Large Baking Sheet, 2 Small Bowls, Large Bowl, optionally a fine-mesh strainer",
			"STEP 1. Wash and dry all produce. Preheat oven to 450 degrees. Halve, peel, and thinly slice onion. Heat a drizzle of oil in a large pan over medium heat. Add onion and cook, tossing occasionally, until nicely browned, 8-10 minutes.",
			"STEP 2. While onion cooks, halve and core pear. Thinly slice one half; cut other half into 1/4-inch cubes. Thinly slice mozzarella or tear it into small pieces. Once onion is browned, stir half the vinegar and 1 teaspoon sugar into pan. Let reduce until syrupy, 1-2 minutes more. Season with salt and pepper. Remove from pan and set aside in a small bowl.",
			"STEP 3. Place flatbreads on a baking sheet. Evenly scatter mozzarella over flatbreads, then repeat with onion and sliced pear. Bake in oven until mozzarella melts and flatbreads are golden brown, 10-12 minutes.",
			"STEP 4. While flatbreads bake, wipe out pan used for onion, then heat 2 tablespoons of olive oil and a pinch of chili flakes (about 1/4 teaspoon) in it over medium-high heat. Immediately remove pan from heat once oil is hot and begins to bubble slightly, 1-2 minutes. Pour chili oil into a small bowl and let cool.",
			"STEP 5. Place lettuce, cubed pear, a drizzle of olive oil, and 1 teaspoon vinegar in a large bowl and toss to combine. Season with salt, pepper, and more vinegar to taste.",
			"STEP 6. Cut baked flatbreads into slices and drizzle with chili oil to taste. (TIP: For less heat, strain out the chili flakes using a fine-mesh strainer.) Serve with salad on the side."
		],
		[
			"HEIRLOOM TOMATO FLATBREADS",
			"VEGETARIAN",
			"A sweet dish that tastes as much like desert as it does dinner.",
			"4 oz Heirloom Grape Tomatoes, 4 oz Fresh Mozzarella, 1 oz Walnuts, 2 Flatbreads, 2 oz Pesto, 3 teaspoons Balsamic Vinegar, 2 oz Arugula, 5 teaspoons Basil Oil, Table Salt, Pepper, 2 teaspoon Olive Oil, ",
			"Oven, Cutting Board, Knife, Whisk, Wooden Stirring Spoon, Spatula, Large Baking Sheet, Medium Bowl",
			"STEP 1. Adjust rack to upper position and preheat oven to 450 degrees. Wash and dry all produce. Halve tomatoes lengthwise. Thinly slice mozzarella. Roughly chop walnuts.",
			"STEP 2. Place flatbreads on a baking sheet. Spread pesto over top of flatbreads in an even layer.",
			"STEP 3. Top flatbreads with mozzarella and tomatoes. Bake in oven until cheese is melty and tomatoes are softened, 8-10 minutes.",
			"STEP 4. Meanwhile, in a medium bowl, whisk together 1 tablespoon of vinegar and a large drizzle of olive oil.",
			"STEP 5. Add arugula to bowl with dressing and toss to combine. Season with salt and pepper.",
			"STEP 6. Top baked flatbreads with salad and sprinkle with walnuts. Drizzle with basil oil (to taste). Cut into slices and serve."
		],
		[
			"ZUCCHINI AND TOMATO FLATBREADS",
			"VEGETARIAN",
			"Sweet and zesty flatbreads that taste as good as they are filling.",
			"1 Zucchini, 4 oz Grape Tomatoes, 2 Cloves of Garlic, 1 Lemon, 4 oz Ricotta Cheese, 2 Flatbreads, 1/2 oz Basil, 1 teaspoon Chili Flakes, 1 tablespoon of Honey, Table Salt, Pepper, 1 teaspoon Vegetable Oil, 2 1/2 teaspoon of Olive Oil",
			"Large Baking Sheet, Zester, Large Pan, 2 Small Bowls, Cutting Board, Knife, Wooden Stirring Spoon, Spatula",
			"STEP 1. Adjust rack to top position and place a lightly oiled baking sheet on it. Preheat oven to 450 degrees with sheet inside. Wash and dry all produce. Halve zucchini lengthwise, then cut crosswise into thin half-moons. Halve tomatoes. Mince or grate garlic. Zest lemon until you have 1 teaspoon; quarter lemon.",
			"STEP 2. Heat a drizzle of olive oil in a large pan over medium-high heat. Add zucchini and cook, stirring, until lightly browned and softened, 5-6 minutes. Season with salt and pepper.",
			"STEP 3. Meanwhile, in a small bowl, combine tomatoes, garlic, and a drizzle of olive oil. Season with salt and pepper.",
			"STEP 4. In a second small bowl combine ricotta cheese, 1 tablespoon of lemon juice, 1/2 teaspoon of olive oil, and half the lemon zest. Season with salt and pepper.",
			"STEP 5. Remove preheated baking sheet from oven and place flatbreads on it. Evenly spread flatbreads with ricotta. Top with zucchini and tomatoes, cut sides up. Bake until flatbreads are golden brown, about 10 minutes.",
			"STEP 6. Pick basil leaves from stems and roughly tear into pieces. Once flatbreads are done baking, top with torn basil, remaining lemon zest, and chili flakes. Drizzle with honey, then cut into slices. Serve with remaining lemon wedges on the side for squeezing over."
		],
		[
			"BAY SCALLOP LINGUINE",
			"FISH",
			"A sweet and savory pasta dish. The tomato and bay scallop flavors are of particular note.",
			"1 Lemon, 0.75 ounce Chives, 1 Roma Tomato, 2 Cloves of Garlic, 8 oz Bay Scallops, Linguine Pasta, 4 tablespoons of Cream Cheese, 1 tablespoon of Chicken Stock Concentrate, 1/2 cup Shredded Parmesan, Table Salt, Pepper, 1 teaspoon Vegetable Oil, 2 tablespoon Butter, 1/4 cup Water, ",
			"Oven, Cutting Board, Knife, Large Pot, Large Pan, Wooden Stirring Spoon, Spatula",
			"STEP 1. Bring a large pot of salted water to a boil. Wash and dry all produce. Peel and finely chop garlic. Zest and quarter lemon. Dice tomato, finely chop chives, Pat scallops dry with paper towels; season all over with salt and pepper.",
			"STEP 2. Once water is boiling, add pasta to pot. Cook, stirring occasionally, until al dente, 9-11 minutes. Reserve 1/2 cup pasta cooking water, then drain.",
			"STEP 3. Meanwhile, heat 1 tablespoon of butter and a drizzle of oil in a large pan over high heat. Once pan is very hot, add scallops and cook, stirring occasionally, until browned and cooked through, 2-3 minutes. Transfer scallops to a plate and set aside. Remove pan from heat to cool for 1 minute, then heat over medium low.",
			"STEP 4. Add 1 tablespoon butter and garlic to same pan; cook until fragrant, 30 seconds. Add tomato and season with salt and pepper. Cook, stirring, until just softened, 2-3 minutes. Stir in cream cheese, stock concentrate, and 1/4 cup plain water. Add half the Parmesan (save the rest for serving); stir until thoroughly combined. Remove pan from heat. Season sauce with salt and pepper.",
			"STEP 5. Once pasta is drained, heat pan with sauce over medium heat; add pasta, scallops (discard any excess liquid on plate), lemon zest, half the chives, and a squeeze of lemon juice. Toss, adding splashes of reserved pasta cooking water as necessary, until pasta is thoroughly coated in sauce, 1-2 minutes. Season with salt and pepper.",
			"STEP 6. Divide pasta between bowls and top with remaining chives and parmesan. Serve with remaining lemon wedges on the side (for squeezing)."
		],

		[
			"CRISPY CAJUN CATFISH",
			"FISH",
			"A tasty dish that, combined with salad and corn on the side, makes for a satisfying dinner.",
			"4 oz Collard Greens, 1 Shallot, 2 Cloves of Garlic, 1 Lemon, 1/2 cup Panko Breadcrumbs, 2 Catfish Fillets, 1 tablespoon Cajun Spice, 1 tablespoon Flour, 2 tablespoon Mayonnaise, 2 Corn on the Cob, 1 teaspoon of Hot Sauce, Table Salt, Pepper, 5 teaspoon Olive Oil, 1 tablespoon Butter, 1/4 cup of Water for splashing on collard greens",
			"Shallow Dish, Paper Towels, Large Pan, Large Baking Sheet, Cutting Board, Knife, Stove Top, Wooden Stirring Spoon, Spatula, Tin foil (for covering various parts of dish), Broiler",
			"STEP 1. Wash and dry all produce. Preheat broiler to high. Remove stems and any tough ribs from collard greens and discard. Roughly chop leaves. Halve, peel, and finely chop shallot. Mince or grate garlic. Cut lemon into wedges. Place panko into a shallow dish and season with salt and pepper.",
			"STEP 2. Pat catfish dry with a paper towel. Season all over with Cajun spice, salt, and pepper. Sprinkle with flour and rub into fish to moisten and evenly coat. Brush fillets all over with mayonnaise then dip into panko, flipping to coat all over and gently pressing to adhere. Set aside.",
			"STEP 3. Heat a drizzle of olive oil in a large pan over medium heat (use a nonstick pan if you have one). Add shallot and cook until softened, 2-3 minutes. Add garlic and cook until fragrant, 1 minute. Season with salt and pepper. Toss in collard greens and cook until tender, 5-7 minutes, adding a splash of water halfway. Season with salt and pepper.",
			"STEP 4. Meanwhile, rub each ear of corn with a drizzle of olive oil. Place on a baking sheet. Broil until slightly charred, about 10 minutes, turning halfway through. Season with salt and pepper.",
			"STEP 5. Remove collard greens from pan and set aside, covered with tin foil, to keep warm. Heat a large drizzle of olive oil in same pan over medium-high heat. Add catfish and cook for 1 minute, then lower heat to medium and continue cooking until fish is cooked through and crust is golden brown, 4-6 minutes per side. (TIP: Lower heat if crust browns too fast.) Season with salt and pepper.",
			"STEP 6. Divide collard greens and catfish between plates. Add a pat of butter to corn (we used 1/2 tablespoon each) and serve corn to the side. Squeeze a bit of lemon over everything and sprinkle with hot sauce (to taste)."
		],

		[
			"CRISPY BAKED COD",
			"FISH",
			"A staple with a spicy kick to it. Mixed veggies and corn on the side complete this tasty meal.",
			"12 oz Yukon Gold Potatoes, 6 oz Green Beans, 1 Scallion, 1 Lemon, 1/4 cup Panko Breadcrumbs, 1/2 tablespoon Fry Seasoning, 2 Cod Fillets, 2 Corn on the Cob, 2 teaspoon Olive Oil, 2 tablespoon Butter, Table Salt, Pepper",
			"Oven, 2 Large Pots, Large Baking Sheet, Strainer, Small Bowl, Paper Towels, Cutting Board, Knife, Oven, Wooden Stirring Spoon, Spatula",
			"STEP 1. Wash and dry all produce. Preheat oven to 400 degrees. Bring a large pot of salted water to a boil. Cut potatoes into bite-sized pieces; add to another large pot with a large pinch of salt and enough water to cover by 1 inch. Bring to a boil and cook until just shy of tender, about 10 minutes.",
			"STEP 2. Meanwhile, cut green beans into 2-inch pieces. Once potatoes have cooked 10 minutes, add green beans to pot and cook until both are tender, 4-5 minutes more. Drain and return everything to pot. Meanwhile, trim, then thinly slice 1 scallion, keeping greens and whites separate. Cut lemon in half. Cut one half into wedges.",
			"STEP 3. Combine panko, 3/4 teaspoon of fry seasoning, a drizzle of olive oil, and a pinch of salt and pepper in a small bowl. Toss to combine. Rinse cod, then pat dry with paper towels. Season all over with salt, pepper, and another 3/4 teaspoon fry seasoning. Place on a lightly oiled baking sheet. Sprinkle panko mixture over tops of fillets, pressing to adhere.",
			"STEP 4. Bake cod in oven until flesh is opaque and crumbs are golden brown, about 10 minutes. Once water in first large pot is boiling, add corn. Cook until tender and bright yellow, 5-7 minutes. Drain.",
			"STEP 5. Add scallion whites and 1 and 1/2 tablespoon butter to pot with potatoes and green beans. Return to stove over medium heat and toss until butter is melted. Squeeze in juice from lemon half and toss to coat. Season with salt and pepper.",
			"STEP 6. Divide cod and green bean and potato mixture between plates. Season corn with salt and add a small pat of butter to each cob (we used 1/4 tablespoon each). Sprinkle scallion greens over everything and serve with lemon wedges on the side for squeezing over."
		],

		[
			"FISH & CHIPS",
			"FISH",
			"A classic staple with a slight twist. Instead of cod this has tilapia and is served with fries, zucchini, and dill pickles. A good choice if you want to try an old dish in a new way.",
			"12 oz Yukon Gold Potatoes, 1 Lemon, 1 Dill Pickle, 1 Zucchini, 1 tablespoon Fry Seasoning, 2 Tilapia Fillets, 1/2 cup Flour, 1 teaspoon Baking Powder, 2 tablespoon Cornstarch, 2 tablespoon Sour Cream, 2 tablespoon Mayonnaise, 8 teaspoon Oil, Table Salt, Pepper, 3/4 cup of Water",
			"Baking Sheet, Medium Bowl, Large Pan, Paper Towels, Small Bowl, Cutting Board, Wooden Stirring Spoon, Oven, Broiler, Spatula, Knife, Whisk",
			"STEP 1. Wash and dry all produce. Adjust rack to middle position and preheat oven to 450 degrees. Cut potatoes into 1/4-inch-thick wedges. Cut lemon into wedges. Cut pickle lengthwise into quarters; finely chop one quarter. Halve zucchini crosswise, then cut each half lengthwise into eight wedges.",
			"STEP 2. Toss potatoes on a baking sheet with half the fry seasoning, a drizzle of oil, salt, and pepper. Roast in oven until tender and crisped, about 20 minutes, tossing halfway through.",
			"STEP 3. Cut tilapia lengthwise into 1-inch-wide strips (you'll have about six). Season all over with salt and pepper. Whisk flour, baking powder, remaining fry seasoning, cornstarch, and 3/4 cup of water in a medium bowl. Season with salt and pepper. Add tilapia to bowl, one piece at a time, tossing to coat in batter.",
			"STEP 4. Heat a thin layer of oil in a large pan over medium-high heat (we used 2 tablespoons). Once oil is hot, remove tilapia from bowl, letting excess batter drip off, and add to pan. Cook until deeply golden and crisp, about 5 minutes per side. Transfer to a paper-towel-lined plate and immediately season with salt and pepper. TIP: Work in batches, taking care not to overcrowd the pan.",
			"STEP 5. While fish cooks, combine chopped pickle, sour cream, and mayonnaise in a small bowl. Stir in a squeeze or two of lemon (to taste). Season with salt and pepper. Once potatoes are done roasting, remove from baking sheet and set aside, covered, to keep warm. Heat broiler to high or increase oven temperature to 500 degrees.",
			"STEP 6. Toss zucchini on same baking sheet with a drizzle of oil, salt, and pepper. Broil (or bake) until tender and browned, about 10 minutes. Divide between plates, along with tilapia, potatoes, and pickle quarters (split one in half, unless they're too good to share). Serve with tartar sauce for dipping and lemon wedges for squeezing over."
		],
		[
			"TEX-MEX TILAPIA",
			"FISH",
			"Hearty and zesty meet in a dish that'll leave you satisfied and full.",
			"1 tablespoon Vegetable Stock Concentrate, 1/4 oz Cilantro, 1 Lime, 1/2 cup Panko Breadcrumbs, 1 tablespoon Southwest Spice Blend, 1/2 cup Couscous, 2 Tilapia Fillets, 6 oz Green Beans, 6 tablespoon Sour Cream, 1 teaspoon Chipotle Powder, Table Salt, Pepper, 3 tablespoon Vegetable Oil, 3/4 cup Water, ",
			"Stove, Small Pot with Lid, Basting Brush, Shallow Dish, Baking Sheet, Large Pan, Small Bowl, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Fork",
			"STEP 1. Preheat oven to 400 degrees. Wash and dry all produce. Bring 3/4 cup water, stock concentrate, and a pinch of salt to a boil in a small pot. Finely chop cilantro. Cut lime into wedges. Stir together panko and Southwest Spice in a shallow dish or bowl. Season with salt and pepper.",
			"STEP 2. Place green beans on a baking sheet and toss with a drizzle of vegetable oil. Season with salt and pepper.  Roast green beans in oven until tender, 12-15 minutes. Once stock is boiling, add couscous to pot. Cover, then remove from heat. Let stand, covered, until liquid is absorbed and grains are tender.",
			"STEP 3. Brush tilapia all over with 2 tablespoon sour cream. Season with salt and pepper. Dip each fillet into panko mixture, coating all over and pressing to adhere.",
			"STEP 4. Heat a thin layer of oil in a large pan over medium-high heat (we used 2 tablespoons of oil; use a nonstick pan if you have one). Add tilapia to pan and cook until flesh is opaque and panko is golden brown, 4-5 minutes per side.",
			"STEP 5. While fish cooks, combine remaining sour cream, a squeeze of lime, and chipotle powder (to taste) in a small bowl. Season with salt and pepper.",
			"STEP 6. Fluff couscous with a fork, then stir in half the cilantro and a squeeze of lime. Season with salt and pepper. Divide between plates, then place tilapia on top. Dollop with crema. Sprinkle remaining cilantro over everything. Serve with any remaining lime wedges."
		],
		[
			"FRIED TILAPIA SANDWICHES",
			"FISH",
			"A spicy sauce tops this otherwise savory dish, served with cabbage cucumber slaw on the side.",
			"1 Persian Cucumber, 2 Scallions, 4 oz Red Cabbage, 5 teaspoon White Wine Vinegar, 2 Brioche Buns, 1/2 cup Panko Breadcrumbs, 1 tablespoon Fry Seasoning, 6 tablespoon Sour Cream, 2 Tilapia Fillets, 2 teaspoon Hot Sauce, Table Salt, Pepper, 1 teaspoon Sugar, 2 teaspoon Olive Oil, 1 tablespoon Butter, Vegetable Oil (for frying)",
			"Medium Bowl, Small Bowl, Large Pan, Stove-Top, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Shallow Dish",
			"STEP 1. Wash and dry all produce. Thinly slice cucumber on a diagonal. Trim and thinly slice scallions. In a medium bowl, combine scallions, cucumber, cabbage, vinegar, 1 teaspoon sugar, and a large drizzle of olive oil. Season with salt and pepper.",
			"STEP 2. Halve buns. Melt 1 tablespoon of butter in a large pan over medium-high heat (use a nonstick pan if you have one). Add buns, cut sides down, and toast until golden, 2-3 minutes. Set aside.",
			"STEP 3. While buns toast, in a shallow dish, combine panko, 1/2 teaspoon salt, and 2 teaspoon fry seasoning (save the last teaspoon for step 5). Brush 2 tablespoon sour cream onto tilapia, coating all over. Season with salt and pepper. Dip each fillet into panko mixture, coating all over and pressing to adhere.",
			"STEP 4. Heat a 1/4-inch layer of oil in pan used for buns over medium-high heat. Add tilapia and cook until panko is golden and fish is cooked through, 3-4 minutes per side.",
			"STEP 5. In a small bowl, combine remaining sour cream, remaining Fry Seasoning, and half the hot sauce. Season with salt and pepper.",
			"STEP 6. Cut tilapia into 3-inch pieces. Spread sauce onto cut sides of buns. Fill buns with tilapia and a bit of slaw. (TIP: If there's more fish than will fit, serve it on the side.) Drizzle with remaining hot sauce (to taste). Divide between plates and serve with remaining slaw on the side."
		],
		[
			"TROPICAL TILAPIA TACOS",
			"FISH",
			"A tangy fish taco dish with hints of spice that will surprise the pallet.",
			"1 Mango, 1 Lime, 4 oz Red Cabbage, 1 tablespoon Southwest Spice Blend, 2 Tilapia Fillets, 4 tablespoon Sour Cream, 1 teaspoon Chipotle Powder, 6 Flour Tortillas, 1/4 oz Cilantro, Table Salt, Pepper, 2 teaspoon Olive Oil, 1/4 cup of water (for stirring into the crema in step 5)",
			"Oven, Microwave, Peeler, Medium Bowl, Small bowl, Large Pan, Paper Towel, Cutting Board, Knife, Wooden Stirring Spoon, Spatula",
			"STEP 1. Wash and dry all produce. Peel mango, then remove flesh from pit; discard pit. Cut flesh into thin slices, then cut slices into skinny matchsticks. Halve lime.",
			"STEP 2. Place mango, cabbage, and a squeeze of lime juice in a medium bowl. Season with salt and pepper. Toss to combine, then set aside.",
			"STEP 3. Set aside 1/2 teaspoon southwest spice in a small bowl. Season tilapia all over with salt, pepper, and remaining southwest spice. Sprinkle with a drizzle of olive oil. Rub seasoning into fillets until moist.",
			"STEP 4. Heat a drizzle of olive oil in a large pan over medium-high heat (use a nonstick pan if you have one). Add tilapia and cook until opaque and flaky, 3-4 minutes per side.",
			"STEP 5. Meanwhile, add sour cream and a pinch of chipotle powder to bowl with reserved 1/2 teaspoon southwest spice. Season with salt, pepper, and more chipotle powder (to taste). Stir in water 1 teaspoon at a time until mixture has a drizzly consistency.",
			"STEP 6. Wrap tortillas in a damp paper towel and microwave on high until warm, about 30 seconds. Break up tilapia into bite-sized pieces and divide between tortillas. Top with slaw (you may not use all). Tear cilantro leaves from stems and scatter over. Drizzle with crema. Serve with any remaining slaw on the side."
		],
		[
			"CLASSIC ROASTED SALMON",
			"FISH",
			"A delicious staple that's quick to prepare, cook, and eat.",
			"4 oz. Heirloom Grape Tomatoes, 2 Cloves of Garlic, 1/4 oz Dill, 12 oz Yukon Gold Potatoes, 6 oz. Green Beans, 2 Salmon Filets, Table Salt, Pepper, 1 tablespoon of Butter, 1 tablespoon of Olive Oil",
			"Large Pot, Baking Sheet, Large Pan, Slotted Spoon, Wooden Stirring Spoon, Spatula, Strainer, Cutting Board, Knife, Oven, Stove-Top",
			"STEP 1. Wash and dry all produce. Adjust rack to middle position and preheat oven to 425 degrees. Fill a large pot with water and a pinch of salt and bring to a boil. Halve tomatoes lengthwise. Thinly slice garlic. Pick dill fronds from stems and finely chop. Slice potatoes into 1/2-inch-thick rounds.",
			"STEP 2. Once water is boiling, add green beans to pot. Let boil until they turn bright green, 1-2 minutes. Remove from pot with a slotted spoon and transfer to a strainer, keeping pot of boiling water on stove. Rinse green beans under cold water. Add potatoes to same pot and boil until easily pierced by a knife, 12-15 minutes, then drain and let cool slightly.",
			"STEP 3. Meanwhile, melt 1 tablespoon of butter in a large pan over medium heat. Add tomatoes and season with salt and pepper. Cook, tossing, until slightly wilted, 2-3 minutes. Add green beans and garlic. Cook, tossing, until tender, 2-3 minutes. Stir in half the dill. Season with salt and pepper. Remove from pan and set. aside, covered, to keep warm.",
			"STEP 4. Place salmon skin-side down on a lightly oiled baking sheet. Sprinkle with a drizzle of olive oil. Season with salt and pepper. Roast in oven to desired doneness, 8-10 minutes.",
			"STEP 5. Once potatoes are cool enough to touch, transfer to a cutting board and lightly crush each round with the back of your knife. Heat a drizzle of olive oil in pan used for veggies over medium-high heat. Add potatoes and cook until browned, 2-3 minutes per side. (Tip: Work in batches if you can't fit them all.) Sprinkle with remaining dill. Season with salt and pepper.",
			"STEP 6. Divide green beans, tomatoes, salmon, and potatoes between plates and serve."
		],
		[
			"TERIYAKI SALMON",
			"FISH",
			"Deeply savory and a little bit sweet. It's so good you might just lick your plate.",
			"1 Thumb of Ginger, 2 Scallions, 1 Lime, 6 oz Green Beans, 3/4 cup Jasmine Rice, 2 Skin-On Salmon Filets, 4 oz Teriyaki Sauce, 1 tablespoon Sesame Seeds, Table Salt, Pepper, 4 teaspoon Olive Oil, 1 and 1/4 Cup Water",
			"Broiler, Oven, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Fine Mesh Sieve, Medium Pot with Lid, Baking Sheet, Small Pan",
			"STEP 1. Wash and dry all produce. Preheat oven to 400 degrees. Peel ginger, then mince until you have 2 teaspoons. Trim, then thinly slice scallions, keeping greens and whites separate. Cut limes into wedges. Place rice in a fine mesh sieve and rinse under running water.",
			"STEP 2. Heat a drizzle of olive oil in a medium pot over medium heat. Add ginger and scallion whites and cook, tossing, until fragrant, 1-2 minutes. Add rice and toss to coat. Pour in 1 and 1/4 cups water and add a large pinch of salt. Cover, bring to a boil, then lower heat and let simmer until water is absorbed, 15-20 minutes.",
			"STEP 3. Meanwhile, place salmon skin-side down in the center of a baking sheet and season with salt and pepper. Sprinkle each fillet with a drizzle of olive oil. Toss green beans with a drizzle of olive oil, salt, and pepper on same sheet. Roast in oven until salmon is opaque on surface but not cooked through, about 5 minutes.",
			"STEP 4. While salmon and green beans roast, place teriyaki sauce in a small pan over medium heat. Bring to a simmer and let bubble until thick and glaze-like, about 3 minutes. Set aside 2 tablespoons of sauce for brushing the fish and reserve the rest for serving, keeping the two separate.",
			"STEP 5. After salmon and green beans have roasted 5 minutes, remove baking sheet from oven. Heat broiler to high. Brush 1 tablespoon of teriyaki sauce onto one salmon fillet, then sprinkle with sesame seeds. Repeat with the other fillet. Place sheet under broiler and broil until salmon is cooked to desired doneness and green beans are lightly browned, 3-4 minutes.",
			"STEP 6. Fluff rice with fork then season with salt, pepper, and a squeeze of lime. Divide between plates, then top with salmon and green beans. Garnish with scallion greens. Serve with lime wedges and reserved teriyaki sauce on the side for drizzling over."
		],

		[
			"CREAMY LEMON SALMON",
			"FISH",
			"The savoriness of salmon topped with the tanginess of tomatoes and lemon juice. Served over a bed of couscous.",
			"1 Roma Tomato, 1 Lemon, 2 Scallions, 2 Cloves of Garlic, 4 tablespoons of Sour Cream, 1/2 cup Israeli Couscous, 2 Skin-On Salmon Filets, 1 tablespoon of Fry Seasoning, 2 tablespoons of Butter, 1 tablespoon of Vegetable Oil, 1 cup of Water, Table Salt, Pepper",
			"Zester, Medium Pan, Small Bowl, Paper Towels, Medium Pot, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Stove-top, Fork",
			"STEP 1. Wash and dry all produce. Core and seed tomato, then cut into 1/2-inch pieces. Zest lemon until you have 1 teaspoon zest, then cut into wedges. Trim, then thinly slice scallions, keeping greens and whites separate. Mince or grate garlic.",
			"STEP 2. In a small bowl, stir together sour cream, half the lemon zest, and a few squeezes of lemon juice. Season with salt and pepper. Taste and add more lemon zest or juice, if desired.",
			"STEP 3. Melt 1 tablespoon of butter in a medium pot over medium-high heat. Add couscous and cook, stirring occasionally, until lightly toasted, 2-3 minutes. Add 1 cup water, then bring to a boil. Lower heat slightly and let simmer until al dente, 7-9 minutes. Remove couscous from pot and set aside.",
			"STEP 4. Heat 1 tablespoon of butter and a large drizzle of oil in pot used for couscous over medium-high heat. Once butter melts, add scallion whites and tomato. Cook, stirring frequently, until slightly softened, 2-3 minutes. Lower heat to medium and add garlic. Cook until fragrant, about 1 minute. Stir in couscous, Season with salt and pepper, then remove pot from heat.",
			"STEP 5. Heat a drizzle of oil in a medium pan over medium-high heat (use a nonstick pan if you have one). Pat salmon dry with a paper towel. Season all over with salt, pepper, and fry seasoning. Add to pan skin-side down. Cook until skin is crisp, 4-6 minutes. Flip and cook to desired doneness, 2-3 minutes more.",
			"STEP 6. Fluff couscous with a fork, then stir in half the scallion greens. Divided between plates, along with salmon. (TIP: Arrange fillets skin-side up to keep the skin crisp.) Drizzle salmon with a spoonful of crema. Sprinkle with remaining scallion greens. Serve with any remaining lemon wedges and crema on the side."
		],

		[
			"PORK CHIL OVER SWEET POTATOES",
			"PORK",
			"Topped with pepper jack cheese and southwest crema every bite of this spicy dish is like an explosion of new flavor, due in large part to the combination of pork chili and roasted sweet potato.",
			"3 Cloves Garlic, 1 Scallion, 2 Sweet Potatoes, 2 tablespoon Sour Cream, 1 tablespoon Southwest Spice, 1/2 pound Ground Pork, 4 tablespoon Tomato Paste, 1/2 cup Shredded Pepper Jack Cheese, 1 tablespoon Hot Sauce, 1 tablespoon Chicken Stock Concentrate, 1/4 cup Water (for splashing in step 2), 1/3 cup Water(for step 5), Table Salt, Pepper, 1 tablespoon Butter",
			"Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Fork, Microwave, Microwave-Safe Plate, Small Bowl, Large Pan, Stove-Top",
			"STEP 1. Wash and dry all produce. Peel and finely chop garlic. Trim and thinly slice scallions, separating whites from greens. Using a fork, prick sweet potatoes all over. Place on a microwave-safe plate; set aside.",
			"STEP 2. In a small bowl, combine sour cream and 1/4 teaspoon southwest spice(you'll use the rest later). Add water 1 teaspoon at a time until mixture reaches a drizzling consistency. Season with salt and pepper.",
			"STEP 3. Microwave sweet potatoes until tender, 6-10 minutes. (If sweet potatoes are still firm, continue to microwave in 1-minute intervals until easily pierced with a fork.) Carefully remove from microwave and let cool slightly.",
			"STEP 4. Meanwhile, heat a drizzle of oil in a large pan over medium-high heat. Add pork and season with salt and pepper. Cook, breaking up meat into pieces, until browned and cooked through, 4-6 minutes. Add garlic, scallion whites, and remaining southwest spice. Cook, stirring, until fragrant, 30 seconds.",
			"STEP 5. Stir in tomato paste, stock concentrate, and 1/3 cup of water. Cook, stirring, until thickened, 1-2 minutes. Season with salt and pepper.",
			"STEP 6. Halve sweet potatoes lengthwise; fluff insides with a fork. Top each half with 1/2 tablespoon butter; sprinkle with salt. Divide sweet potatoes between plates; evenly top with pork chili and cheese. Drizzle with crema and hot sauce if desired. Sprinkle with scallion greens."
		],
		[
			"BACON GRILLED CHEESE SANDWICHES",
			"PORK",
			"A sweet dish topped with caramelized onion. Served with carrot fries on the side.",
			"12 oz Carrots, 1 Yellow Onion, half of a 16 oz package of bacon, 4 Slices of Sourdough Bread, 1/2 cup of Shredded Mozzarella Cheese, 1/2 cup of Shredded Pepper Jack Cheese, 2 tablespoons of Butter, 2 teaspoons of Vegetable Oil, 2 teaspoons of Sugar, Table Salt, Pepper, 1/4 cup Water(for Step 3)",
			"Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Oven, Microwave, 2 Small Bowl, 2 Large Baking Sheets, Large Pan",
			"STEP 1. Preheat oven to 425 degrees. Place 2 tablespoons of butter in a small bowl; set aside to soften. Wash and dry all produce. Trim, peel, and cut carrots into long thin sticks, like fries. (Ours were 3 inches long and 1/3 inch wide.) Place bacon on a baking sheet in a single layer.",
			"STEP 2. Toss carrots on a second baking sheet with a drizzle of oil, salt, and pepper. Roast carrots on top rack and bacon on middle rack until carrots are browned and tender and bacon is crispy, 18-22 minutes for carrots and 15-20 minutes for bacon. (Check often to avoid burning.)",
			"STEP 3. Meanwhile, halve, peel, and thinly slice onion. Heat a drizzle of oil in a large pan over medium-high heat. Add onion; season with salt and pepper. Cook, stirring, until softened and lightly browned, 8-10 minutes. Add 1/4 cup of water and 2 teaspoons of sugar. Cook, stirring, until caramelized and jammy, 2-3 minutes more. (If onion begins to burn, stir in a splash of water.) Turn off heat; transfer to a second small bowl and set aside. Wash out pan.",
			"STEP 4. While onion cooks, spread one side of each slice of bread with softened butter (if butter is not yet softened, microwave for 5-10 seconds). Place bread buttered sides down on your cutting board; evenly top half the slices with mozzarella and pepper jack.",
			"STEP 5. Roughly chop bacon; evenly sprinkle onto cheese layer. Scatter caramelized onion on top of bacon layer. Top with remaining bread, buttered sides up, to form two sandwiches.",
			"STEP 6. Heat pan used for onion over medium heat. Once hot, add sandwiches and cook until bread is golden brown and cheese have melted, 5-6 minutes per side. Cut sandwiches in half on a diagonal and divide between plates. Serve with carrot fries on the side."
		],
		[
			"BACON MAC & CHEESE",
			"PORK",
			"A savory and spicy twist on a staple.",
			"Half a 16 oz package of bacon, 1 Yellow Onion, 1 Clove of Garlic, 1 Jalapeño, 2 cups Cavatappi Pasta, 1 cup Reduced-Fat Milk, 1 cup Shredded Cheddar Cheese, 1 tablespoon of Butter, 1 tablespoon of Flour",
			"Broiler, Strainer, Whisk, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Paper Towels, Medium Ovenproof Pan (alternatively use a regular Medium Pan and a Baking Dish), Stove-Top, Medium Pot",
			"STEP 1. Heat broiler to high. Bring a medium pot of salted water to a boil. Wash and dry jalapeño. Place bacon in a single layer in a medium, preferably ovenproof pan over medium heat. Cook, turning occasionally, until browned and crisp, 8-12 minutes. Turn off heat; transfer to a paper towel-lined plate. Carefully pour out grease from pan.",
			"STEP 2. While bacon cooks, halve, peel, and finely chop onion until you have 1/2 cup (use the rest however you like). Peel and finely chop garlic. Finely chop jalapeño, removing ribs and seeds for less heat. Once water is boiling, add pasta to pot and cook until al dente, 9-11 minutes. Reserve 1/2 cup pasta cooking water, then drain.",
			"STEP 3. Melt 1 tablespoon of butter in pan used for bacon over medium heat. Add onion and season with salt and pepper. Cook, scraping up any browned bits from bottom of pan, until onion is softened, 4-5 minutes.",
			"STEP 4. Add garlic and up to half the jalapeño to pan. Cook until fragrant, 30 seconds, then add 1 tablespoon of flour. Cook, stirring, until lightly browned, 1-2 minutes. Gradually stir in milk a splash at a time until fully incorporated. (If you've got a whisk, use it here for extra smooth sauce). Bring to a boil and cook until thickened, 1-2 minutes more. Season with salt and pepper. Remove from heat.",
			"STEP 5. Roughly chop bacon; stir into sauce along with half the cheese (you'll use the rest later). Stir in drained pasta and splashes of reserved pasta cooking water as necessary until everything is coated in a creamy sauce. Taste and season with salt and pepper. If your pan isn't ovenproof, transfer pasta mixture to a baking dish.",
			"STEP 6. Sprinkle pasta evenly with remaining cheese and as much remaining jalapeño as you'd like. Broil until cheese has melted, 2-3 minutes.  (Watch carefully to avoid burning. The broiler is a powerful tool.) Divide between plates and serve. (If you want to kick things up even more, drizzle with a dash of your favorite hot sauce.)"
		],

		[
			"PORK & POBLANO TACOS",
			"PORK",
			"A sweet and zesty staple. Served with Pico de Gallo and Garlicky Crema",
			"1 Poblano, 1 Roma Tomato, 1 Red Onion, 2 Cloves of Garlic, 1 tablespoon of Southwest Spice, 1 Jalapeño, 1 Lime, 1/2 pound Ground Pork, 4 tablespoons Sour Cream, 6 Flour Tortillas, 2 teaspoons of Vegetable Oil, Table Salt, Pepper",
			"Cutting Board, Knife, Wooden Stirring Spoon, 2 Small Bowls, Large Pan, Stove-Top, Microwave",
			"STEP 1. Wash and dry all produce. Finely dice tomato. Peel and finely chop onion. Finely chop jalapeño, removing ribs and seeds if you prefer less heat. Halve, core, and thinly slice poblano into strips. Peel and finely chop garlic. Quarter lime.",
			"STEP 2. In a small bowl, combine tomato, 2 tablespoons of onion, 2 teaspoons of jalapeño(save the rest for garnish if you'd like), and a big squeeze of lime juice. Taste and season with salt and pepper.",
			"STEP 3. In a second small bowl, combine sour cream, a pinch of garlic, and a squeeze of lime juice. Taste and season with salt, pepper, and more lime juice if you like a tangy punch.",
			"STEP 4. Heat a large drizzle of oil in a large pan over medium-high heat. Add poblano; cook, stirring, until softened and lightly charred, 5-6 minutes. Stir in remaining onion and garlic; cook, stirring, until softened, 3-4 minutes. Add pork and season with salt, pepper, and southwest spice. Cook, breaking up meat into pieces, until pork is browned and cooked through, 4-6 minutes.",
			"STEP 5. Meanwhile, wrap tortillas in damp paper towels and microwave until warm and pliable, 30 seconds.",
			"STEP 6. Divide pork mixture, pico de gallo, and crema between tortillas. Serve with any remaining lime wedges on the side. (Sprinkle with remaining jalapeño if you want an extra kick.)"
		],
		[
			"SWEET 'N' SMOKY BBQ PORK MEATLOAVES",
			"PORK",
			"A sweet and savory dish. Served with sweet potato wedges and roasted zucchini on the side.",
			"2 teaspoon Ancho Chili Powder, 1/2 pound Ground Pork, 1 Slice of White Bread, 1 Zucchini, 1 tablespoon of BBQ Seasoning, 2 tablespoon Cherry Jam, 2 Sweet Potatoes, Table Salt, Pepper, 1/4 cup Ketchup, 1 tablespoon Olive Oil, 3 tablespoons of water",
			"Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Oven, 2 Large Baking Sheets, Medium Bowl, Small Bowl, Glaze Brush",
			"STEP 1. Adjust racks to top and middle positions and preheat oven to 425 degrees. Wash and dry all produce. Cut sweet potatoes into 1/2-inch-thick wedges. Trim and halve zucchini lengthwise; cut crosswise into 1/2-inch-thick half-moons.",
			"STEP 2. Tear bread into small pieces; place in a medium bowl with half the chili powder (you'll use the rest later) and 3 tablespoons of water. Let absorb, then break up with your hands until pasty. Add pork, 3/4 teaspoon salt, and pepper; mix to thoroughly combine. Form into two 1-inch tall loaves. Place on one side of baking sheet.",
			"STEP 3. In a small bowl, combine jam, BBQ Seasoning, and 1/4 cup ketchup. Season with salt and pepper. Set aside half the BBQ glaze. Brush or spoon remaining BBQ glaze onto tops of meatloaves.",
			"STEP 4. Toss sweet potatoes on opposite side of sheet from meatloaves with a large drizzle of olive oil, salt, pepper, and remaining chili powder. Roast on top rack for 20 minutes.",
			"STEP 5. Meanwhile, toss zucchini on a second baking sheet with a drizzle of olive oil, salt, and pepper. Roast on middle rack until browned and tender, 15-18 minutes. Remove from oven.",
			"STEP 6. Once meatloaves and sweet potatoes have roasted 20 minutes, remove sheet from oven. Brush or spoon meatloaves with reserved BBQ glaze. Return to oven until meatloaves are cooked through, glaze is tacky, and sweet potatoes are browned and tender, 3-5 minutes more. Divide meatloaves, sweet potatoes, and zucchini between plates. Serve with more ketchup on the side for dipping if desired."
		],
		[
			"BALSAMIC-GLAZED PORK CHOPS",
			"PORK",
			"A sweet and savory dish that's served with roasted zucchini and garlic thyme potatoes on the side.",
			"5 Yukon Gold Potatoes, 1 Zucchini, 2 Pork Chops, half of a 0.75 oz Thyme package, 1 tablespoon Balsamic Vinegar, 1 tablespoon Chicken Stock Concentrate, 2 Cloves of Garlic, 2 teaspoon of Olive Oil, 1 tablespoon Brown Sugar, 2 teaspoon Vegetable Oil, 1 tablespoon Butter, 1/4 cup Water, Table Salt, Pepper",
			"Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Oven, Large Baking Sheet, Paper Towels, Large Pan",
			"STEP 1. Adjust rack to top position and preheat oven to 450 degrees. Wash and dry all produce. Dice potatoes into 1/2-inch pieces. Trim and halve zucchini lengthwise; cut crosswise into 1/2-inch-thick half-moons. Peel and finely chop garlic. Pick thyme leaves from stems until you have 2 teaspoons; roughly chop leaves and discard empty stems. Reserve remaining thyme sprigs for making sauce in step 4.",
			"STEP 2. Toss potatoes on one side of a baking sheet with a drizzle of olive oil, garlic, half the chopped thyme, salt, and pepper. Toss zucchini on empty side with a drizzle of olive oil, salt, and pepper. Roast on top rack until everything is browned and tender, 20-25 minutes. (Check on your veggies periodically - the zucchini may finish first. If so, remove from sheet and continue roasting potatoes.)",
			"STEP 3. While veggies roast, pat pork dry with paper towels; season all over with salt and pepper. Heat a large drizzle of oil in a large pan over medium-high heat. Add pork and cook until browned and cooked through, 4-5 minutes per side. Turn off heat; transfer to a plate to rest. Wipe out pan.",
			"STEP 4. Heat same pan over medium-high heat. Add vinegar, stock concentrate, reserved thyme sprigs, 1/4 cup water, and 1 tablespoon brown sugar. Bring to a simmer and cook, stirring occasionally, until slightly reduced, 2-3 minutes. Season generously with pepper. Turn off heat and stir in 1 tablespoon of butter until melted. Discard thyme sprigs.",
			"STEP 5. Return pork to pan and turn to coat in glaze; divide between plates with potatoes and zucchini. Top pork with any remaining glaze and sprinkle with as much remaining chopped thyme as you'd like.",
			null
		],
		[
			"ROASTED PORK TENDERLOIN",
			"PORK",
			"The bell pepper's sweetness and pork's savoriness mix to produce a tasty and satisfying meal. Served with lemony potatoes and bell peppers on the side.",
			"12 oz Yukon Gold Potatoes, 1 Red Onion, 2 Cloves of Garlic, 1 Lemon, 1 Bell Pepper, 1/4 oz Cilantro, 2 Pork Tenderloins, 1 tablespoon Chicken demi-glace, 1 tablespoon Olive Oil, 1 tablespoon Butter, Table Salt, Pepper, 1/2 cup Water",
			"2 Large Baking Sheets, Large Pan, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Oven",
			"STEP 1. Wash and dry all produce. Adjust rack to upper position and preheat oven to 450 degrees. Cut potatoes into 1/2-inch cubes. Toss on a baking sheet with a drizzle of olive oil and a pinch of salt and pepper. Roast in oven until tender and crisped, about 25 minutes, tossing halfway through.",
			"STEP 2. Halve and peel onion, then chop into 1/2-inch pieces. Mince or grate garlic. Halve lemon. Core and seed bell pepper, then cut into 1/2-inch squares. Roughly chop cilantro. Toss onion and bell pepper on another baking sheet with a drizzle of olive oil and a pinch of salt and pepper. Set aside.",
			"STEP 3. Heat a drizzle of olive oil in a large pan over medium-high heat. Season pork all over with salt and pepper. Add to pan and cook, turning occasionally, until browned all over, about 10 minutes total.",
			"STEP 4. Transfer pork to baking sheet with onion and bell pepper. Roast in oven until veggies are tender and pork is cooked to desired doneness, 12-15 minutes. Let pork rest 5 minutes after removing from oven. TIP: If veggies finish cooking first, remove from sheet and return pork to oven.",
			"STEP 5. Meanwhile, lower heat under pan used for pork to medium and add garlic and 1 tablespoon butter. Once butter is melted and garlic is fragrant, 1-2 minutes later, stir in demi-glace and 1/2 cup water, scraping up any browned bits form bottom of pan. Simmer until slightly reduced, 3-4 minutes. Remove pan from heat. Season with pepper and a squeeze of lemon.",
			"STEP 6. Divide potatoes, onion, and bell pepper between plates. Season with salt and pepper. Squeeze a bit of lemon juice over to taste. Slice pork, then arrange on top of potatoes and veggies. Drizzle with pan sauce and garnish with cilantro."
		],

		[
			"ITALIAN PORK SAUSAGE PIZZAS",
			"PORK",
			"A zesty and spicy flatbread served with pickled jalapeño, shallot, and a side salad",
			"6 oz Sweet Italian Pork Sausage, 1 Jalapeño, 1 Shallot, 4 teaspoon White Wine Vinegar, 2 Flatbreads, 1/2 cup Crushed Tomatoes, 4 oz Fresh Mozzarella, 1 teaspoon Italian Seasoning, 2 oz Spring Mix Lettuce, 4 teaspoon Olive Oil, 1/2 teaspoon Sugar, Table Salt, Pepper",
			"Large Baking Sheet, Oven, Broiler, Large Pan, Small Bowl, Medium Bowl, Cutting Board, Knife, Wooden Stirring Spoon, Spatula",
			"STEP 1. Adjust broiler rack so that it is 6-8 inches from flame and place a baking sheet on rack. Preheat broiler to high. Remove sausage from casings. Heat a drizzle of olive oil in a large pan over medium-high heat. Add sausage, breaking up meat. Cook, tossing, until browned, about 4 minutes.",
			"STEP 2. Wash and dry all produce. Slice half the jalapeño into very thin rounds (use the rest as you like). Halve, peel, and thinly slice shallot. Place sliced jalapeño, shallot, 1 tablespoon vinegar (we'll use more later), 1/2 teaspoon sugar, and a pinch of salt in a small bowl. Toss to coat and set aside to pickle.",
			"STEP 3. Carefully remove baking sheet from oven (use your mitts). Place flatbreads on sheet, then spread evenly with just enough tomatoes to coat in a thin layer. Season with salt and pepper.",
			"STEP 4. Tear mozzarella into small pieces with hands and scatter over top of flatbreads, then top with sausage, Italian seasoning, and as much of the pickled jalapeño and shallot as you like. Broil until cheese melts and crust is crisp, 5-10 minutes.",
			"STEP 5. While flatbreads broil, toss together lettuce, 1 teaspoon vinegar, and 1 tablespoon olive oil in a medium bowl. Season with salt and pepper.",
			"STEP 6. Cut flatbreads into slices. Serve with salad on the side. TIP: If you didn't use all of the pickled jalapeño and shallot, serve on the side as an optional garnish."
		],
		[
			"JUICY APPLE PORK BURGER",
			"PORK",
			"Served with rosemary sweet potatoes and green salad on the side this dish is a satisfying, hearty meal.",
			"1/4 oz Rosemary, 2 Sweet Potatoes, 1 Granny Smith Apple, 10 oz Ground Pork, 2 Hamburger Buns, 2 oz Spring Mix Lettuce, 2 teaspoon Balsamic Vinegar, 1 and 1/2 tablespoon Mayonnaise, Table Salt, Pepper, 1 tablespoon Olive Oil",
			"2 Large Baking Sheets, Grater, Paper Towels, 2 Large Bowls, Large Pan, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Oven",
			"STEP 1. Wash and dry all produce. Preheat oven to 425 degrees. Strip rosemary leaves from stems and finely chop until you have 2 teaspoons, discard stems. Cut sweet potatoes into 1/2-inch wedges. Toss with 1 teaspoon of rosemary, a drizzle of olive oil, and a pinch of salt and pepper on a baking sheet. Roast in oven until tender, 25-30 minutes, tossing halfway through.",
			"STEP 2. Meanwhile, halve and core apple. Grate one half onto a paper towel, then squeeze out any excess moisture (do this over the sink). Put grated apple, pork, and remaining 1 teaspoon rosemary in a large bowl. Season with salt and pepper. Combine mixture with your hands, then shape into two patties slightly wider than the buns.",
			"STEP 3. Heat a drizzle of olive oil in a large pan over medium-high heat. Add burgers to pan and cook until no longer pink in center, 4-5 minutes per side.",
			"STEP 4. Meanwhile, split buns in half and place on another baking sheet. Toast in oven until golden brown, 3-5 minutes.",
			"STEP 5. Thinly slice remaining apple half. In another large bowl, toss together lettuce, apple slices, a drizzle of olive oil, and 2 teaspoons of balsamic vinegar. Season with salt and pepper.",
			"STEP 6. Spread buns with 1 and 1/2 tablespoon of mayonnaise, then fill each with a burger and a little bit of the salad. Serve with sweet potatoes and remaining salad on the side."
		],

		[
			"PORK MEATBALL MELT SANDWICHES",
			"PORK",
			"A sweet and savory sandwich served on ciabatta buns with lemony zucchini on the side.",
			"1 Yellow Onion, 2 Cloves of Garlic, 10 oz Ground Pork, 1/2 cup Panko Breadcrumbs, 1 tablespoon Tuscan Heat Spice, 6.88 oz Crushed Tomatoes, 1 Lemon, 1 Zucchini, 2 Ciabatta Bread, 1/2 cup Mozzarella, 1/2 teaspoon Sugar, 5 teaspoon Olive Oil, 1/2 tablespoon Butter, ",
			"Oven, Broiler, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Large Baking Sheet, Zester, Aluminum Foil, Small Pan, Medium Bowl, Small Bowl, Medium Pan",
			"STEP 1. Wash and dry all produce. Adjust rack to middle position and preheat oven to 400 degrees. Line a baking sheet with aluminum foil and sprinkle with a drizzle of olive oil. Halve and peel onion; finely chop one half (save the other for another use). Mince garlic",
			"STEP 2. In a medium bowl mix together pork, panko, 2 tablespoon onion, half the garlic, half the tuscan heat spice, and a large pinch of salt and pepper. Divide into 8 pieces and shape each into a meatball. Place on tin-foil-lined baking sheet. Bake in oven until cooked through, 18-20 minutes.",
			"STEP 3. Meanwhile, heat a drizzle of olive oil in a small pan over medium heat. Add remaining onion and cook until starting to soften, 3 minutes. Toss in remaining garlic and tuscan heat spice and cook until fragrant, 1 minute more.",
			"STEP 4. Stir half the tomatoes from container (save the rest for another use), 1/2 teaspoon of sugar, and a large pinch of salt and pepper into pan. Bring to a simmer and let bubble until thickened, 3-4 minutes. Meanwhile, zest 1/2 teaspoon zest from lemon, then halve and squeeze 2 teaspoons of juice into a small bowl. Halve zucchini lengthwise, then slice crosswise into 1/4-inch-thick half-moons. Remove pan from heat once sauce thickens and stir in 1/2 tablespoon butter.",
			"STEP 5. Heat a drizzle of olive oil in a medium pan over medium-high heat. Add zucchini and a pinch of salt and pepper. Cook, tossing, until softened, about 5 minutes. Stir in reserved lemon juice and zest. Set aside off heat. Remove baked meatballs from sheet. Heat broiler to high. Halve meatballs. Split ciabattas in half and sprinkle cut sides with a drizzle of olive oil each. Place bottoms cut-side up on same sheet.",
			"STEP 6. Spread a little sauce on each ciabatta bottom. Arrange meatballs on top (serve any extras on the side if they don't all fit). Spoon remaining sauce over and sprinkle with mozzarella. Top with remaining ciabatta halves and place under broiler. Broil until mozzarella melts, 2-3 minutes. Divide between plates and serve with zucchini."
		],
		[
			"CREAMY PEPPERCORN CHICKEN",
			"CHICKEN",
			"A savory dish served with roasted potatoes and carrots on the side.",
			"2 Chicken Breasts, 5 Yukon Gold Potatoes, 12 oz Carrots, 2 tablespoon Sour Cream, 1 teaspoon Black Peppercorns, 1 tablespoon Chicken Stock Concentrate, 1 Yellow Onion, 1 bunch of Parsley, Table Salt, Black Pepper, 1 tablespoon Butter, 4 teaspoon Vegetable Oil, 1/4 cup Water",
			"Oven, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Large Baking Sheet, Paper Towels, Large Pan, Small Zip-Close Bag, Rolling Pin",
			"STEP 1. Preheat oven to 425 degrees. Wash and dry all produce. Trim, peel, and cut carrots on a diagonal into 3/4-inch-thick pieces. Dice potatoes into 1/2-inch pieces. Toss carrots and potatoes on opposite sides of a baking sheet with a large drizzle of oil, salt, and pepper. Roast until browned and tender, 25-30 minutes.",
			"STEP 2. Meanwhile, halve, peel, and finely chop onion until you have 1/4 cup. Finely chop parsley. Pat chicken dry with paper towels; season all over with salt and pepper.",
			"STEP 3. Heat a drizzle of oil in a large pan over medium-high heat. Add chicken and cook until browned and cooked through, 5-6 minutes per side. Turn off heat; transfer to a cutting board.",
			"STEP 4. While chicken cooks, place peppercorns in a small zip-close bag; finely crush with a rolling pin or heavy-bottomed pan.",
			"STEP 5. Heat a drizzle of oil in pan used for chicken over medium-high heat. Add chopped onion; cook, stirring, until softened, 2-3 minutes. Add 1/4 cup water and stock concentrate. Bring to a simmer and cook until slightly thickened, 2-3 minutes. Remove pan from heat, then stir in 1 tablespoon of butter, sour cream, and crushed peppercorn (start with 1/4 teaspoon, then taste and add more from there if you'd like).",
			"STEP 6. Thinly slice chicken crosswise. Divide between plates with potatoes and carrots. Drizzle chicken with sauce. Sprinkle everything with parsley."
		],
		[
			"LEMON THYME CHICKEN LINGUINE",
			"CHICKEN",
			"A sweet and savory pasta dish whose sauce as as delightful as the main course.",
			"1 Zucchini, 1 Lemon, 1 Bag Linguine Pasta, 1/2 pound Chicken Breast Strips (cut into bite-sized), 2 Cloves of Garlic, 1 teaspoon Dried Thyme, 1 tablespoon Chicken Stock Concentrate, 2 tablespoon Cream Cheese, 2 tablespoon Sour Cream, Table Salt, Pepper, 2 tablespoon Butter, 2 teaspoon Olive Oil",
			"Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Large Pot, Large Pan, Stove-Top, Paper Towels, Strainer",
			"STEP 1. Bring a large pot of salted water to a boil. Wash and dry all produce. Trim and quarter zucchini lengthwise; cut crosswise into 1/2-inch-thick pieces. Peel and finely chop garlic. Zest and quarter lemon.",
			"STEP 2. Once water is boiling, add pasta to pot. Cook, stirring occasionally, until al dente, 9-11 minutes. Reserve 1 cup pasta cooking water, then drain.",
			"STEP 3. While pasta cooks, heat a drizzle of olive oil in a large pan over medium-high heat. Add zucchini and cook, stirring occasionally, until browned and softened, 7-8 minutes. Season with salt and pepper. Transfer to a plate.",
			"STEP 4. Meanwhile, pat chicken dry with paper towels. Season with half the thyme, salt, and pepper. Once zucchini is done, heat a drizzle of olive oil in same pan over medium-high heat. Add chicken and cook, stirring occasionally, until browned and cooked through, 4-6 minutes. Add garlic and cook until fragrant, 1 minute. Reduce heat under pan to low.",
			"STEP 5. Stir pasta, zucchini, cream cheese, sour cream, stock concentrate, half the lemon zest, 1/4 cup pasta cooking water, 2 tablespoon butter, and a squeeze of lemon juice into pan with chicken until thoroughly combined. Turn off heat; season with salt and pepper. (If sauce seems too thick, add more reserved pasta cooking water a splash at a time until everything is coated in a creamy sauce.)",
			"STEP 6. Divide pasta between bowls. Top with as much remaining lemon zest as you'd like. Serve with remaining lemon wedges on the side."
		],
		[
			"EASY CHICKEN FAJITAS",
			"CHICKEN",
			"A spicy dish drizzled in zesty sour cream.",
			"1 Green Bell Pepper, 1 Red Onion, 1 Lime, 1 Jalapeño, 4 tablespoon Sour Cream, 1/2 pound Chicken Breast Strips(Should be bite-sized), 1 tablespoon Southwest Spice, 6 Flour Tortillas, 1 tablespoon Vegetable Oil, Table Salt, Pepper, 1 teaspoon Water",
			"Cutting Board, Knife, Wooden Stirring Spoon, Large Pan, Microwave, Stove Top, Paper Towels, Small Bowl",
			"STEP 1. Wash and dry all produce. Halve, core, and thinly slice bell pepper into strips. Halve, peel, and thinly slice onion. Zest and quarter lime.",
			"STEP 2. Heat a drizzle of oil in a large pan over medium-high heat. Add bell pepper and cook, stirring, until slightly softened, 3-4 minutes. Add onion and cook, stirring, until browned and tender, 5-6 minutes more. Season with salt and pepper. Turn off heat; transfer to a plate and set aside.",
			"STEP 3. While veggies cook, in a small bowl, combine sour cream, lime zest, a squeeze of lime juice, 1/2 teaspoon southwest spice (you'll use the rest later), and 1 teaspoon water. Season with salt and pepper.",
			"STEP 4. Heat a large drizzle of oil in pan used for veggies over high heat. Add chicken in a single layer. Sprinkle with remaining southwest spice and season with salt and pepper. Cook, stirring occasionally, until browned and cooked through, 4-6 minutes.",
			"STEP 5. Meanwhile, wrap tortillas in damp paper towels and microwave until warm and pliable, 30 seconds.",
			"STEP 6. Thinly slice jalapeño into rounds, removing ribs and seeds if you prefer less heat. Divide chicken and veggies between tortillas. Drizzle with zesty sour cream and top with as many jalapeño slices as you'd like. Serve with any remaining lime wedges on the side."
		],
		[
			"CHEESY CHICKEN & PEPPER QUESADILLAS",
			"CHICKEN",
			"A zesty dish served with southwest crema for dipping or topping",
			"2 tablespoon Sour Cream, 1 Long Green Pepper, 1 tablespoon Southwest Spice, 1/2 pound Chicken Breast Strips (cut bite-sized), 6 Flour Tortillas, 1/2 cup Shredded Mozzarella Cheese, 1/2 cup Shredded Monterey Jack Cheese, 1 tablespoon Vegetable Oil, Table Salt, Pepper, 1 teaspoon Water",
			"Cutting Board, Knife, Wooden Stirring Spoon, Large Pan, Stove-Top, Plate, Small Bowl, Medium Bowl, Paper Towels",
			"STEP 1. Wash and dry all produce. Core, deseed, and dice green pepper into 1/2-inch pieces. Heat a drizzle of oil in a large pan over medium-high heat. Add green pepper and cook, stirring, until softened, 4-6 minutes. Season with salt and pepper. Turn off heat; transfer to a plate.",
			"STEP 2. Meanwhile, place chicken in a medium bowl and pat dry with paper towels. Reserve 1/2 teaspoon southwest spice in a small bowl. Season chicken with remaining southwest spice, salt, and pepper. Heat a drizzle of oil in pan used for green pepper over medium-high heat. Add chicken and cook, stirring occasionally, until browned and cooked through, 4-6 minutes. Turn off heat; transfer to plate with green pepper. Wipe out pan.",
			"STEP 3. While chicken cooks, add sour cream and 1 teaspoon of water to bowl with reserved southwest spice. Stir to thoroughly combine. Season with salt and pepper.",
			"STEP 4. Place tortillas on a clean work surface or cutting board. Evenly sprinkle one side of each tortilla with half of each cheese. Top with chicken and green pepper, then sprinkle with remaining cheese. Fold tortillas in half to create quesadillas.",
			"STEP 5. Heat a drizzle of oil in pan used for chicken over medium heat. Add quesadillas and cook until tortillas are golden brown and cheese melts, 3-5 minutes per side. (Depending on the size of your pan, you may need to work in batches.) Cut quesadillas into 3 wedges each. Divide between plates and serve with crema on the side.",
			null
		],
		[
			"THIN-CRUST CHICKEN ALFREDO FLATBREADS",
			"CHICKEN",
			"A zesty and sweet dish topped with roasted garlic and caramelized onion",
			"1 Yellow Onion, 4 Cloves of Garlic, 1/2 pound Chicken Breast Strips (cut to bite-size), 1 tablespoon Italian Seasoning, 2 Flatbreads, 4 tablespoon Cream Cheese, 1/2 cup Shredded Mozzarella Cheese, 1/2 cup Shredded Monterey Jack Cheese, 1 teaspoon Chili Flakes, 2 tablespoon Butter, 1 tablespoon Flour, 1 teaspoon Olive Oil, 1 teaspoon Sugar, 1 teaspoon Vegetable Oil, Table Salt, Pepper, 1/4 cup Balsamic Vinegar, 1/2 cup water",
			"Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Oven, Large Baking Sheet, Large Pan, Whisk, Tin Foil",
			"STEP 1. Preheat oven to 450 degrees. Wash and dry all produce. Halve, peel, and thinly slice onion. Peel garlic; place cloves in the center of a small piece of tin foil. Add a drizzle of olive oil and season with salt and pepper. Cinch into a packet. Pat chicken dry with paper towels; season with salt, pepper, and half the Italian Seasoning (you'll use the rest later).",
			"STEP 2. Place garlic foil packet on a baking sheet. Roast on top rack until browned and softened, 15-20 minutes. When garlic has 5 minutes left, remove baking sheet from oven. Add flatbreads to same sheet. Return to top rack until lightly toasted, 5-7 minutes.",
			"STEP 3. Heat a drizzle of oil in large pan over medium-high heat. Add onion and cook, stirring occasionally, until browned and softened, 8-10 minutes. Add 1 teaspoon sugar and 1/4 cup balsamic vinegar; continue cooking until caramelized, 2-3 minutes more. Season with salt and pepper.",
			"STEP 4. Add chicken to pan with onion. Cook, stirring occasionally, until browned and cooked through, 4-6 minutes. (If chicken begins to brown too quickly, lower heat.) Turn off heat; stir in 1 tablespoon butter. Transfer to a plate. Wipe out pan.",
			"STEP 5. Transfer roasted garlic to a cutting board; mash cloves with a fork until smooth. Melt 1 tablespoon butter in pan used for chicken over medium-high heat. Whisk in 1 tablespoon flour, mashed garlic, and remaining Italian Seasoning until lightly browned, 1 minute. Slowly whisk in 1/2 cup water until fully incorporated. Reduce heat to medium low; whisk in cream cheese until smooth. Season generously with salt and pepper. (If sauce seems too thick, add a splash of water.)",
			"STEP 6. Evenly spread toasted flatbreads with white sauce. Top with chicken and onion mixture, mozzarella, and monterey jack cheese. Bake on top rack until cheese has melted and flatbreads are crispy, 3-5 minutes. (Watch carefully to avoid burning.) Sprinkle with chili flakes if desired. Slice into pieces."
		],
		[
			"BUFFALO CHICKEN FLATBREADS",
			"CHICKEN",
			"A spicy and zesty dish topped with creamy ranch sauce",
			"1 Long Green Pepper, 1 Roma Tomato, 10 oz. Chicken Stir Fry, 1 teaspoon Celery Salt, 3 teaspoons Ranch Seasoning, 2 Flatbreads, 1/2 cup Mozzarella Cheese, 1 teaspoon Honey, 2 teaspoon Hot Sauce, 1 teaspoon Sriracha, 2 tablespoon Sour Cream, Table Salt, Pepper, 2 teaspoon Olive Oil, 1 and 1/2 tablespoon Butter, 2 tablespoon Water, 1/4 cup Water (for stirring into sauce in step 5)",
			"Large Baking Sheet, Paper Towel, Medium Bowl, Large Pan, 2 Small Bowl, Oven, Microwave, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Plate",
			"STEP 1. Wash and dry all produce. Adjust oven rack to top position and preheat to 450 degrees with a large baking sheet inside. Core, seed, and dice green pepper. Dice tomato. Pat chicken dry with a paper towel. In a medium bowl, combine chicken, celery salt, 2 teaspoon ranch seasoning (we'll use the rest later), and a few pinches of salt and pepper.",
			"STEP 2. Heat a drizzle of olive oil in a large pan over medium-high heat (use a nonstick pan if you have one). Add chicken and green pepper and cook, stirring occasionally, until chicken is cooked through and green pepper is crisp-tender, about 5 minutes. Season with salt and pepper, then remove to a plate.",
			"STEP 3. Reduce heat under same pan to medium. Add tomato and 2 tablespoons of water. Cook until tomato becomes slightly saucy, about 2 minutes. Stir in 1/2 tablespoon butter until melted, then season with salt and pepper.",
			"STEP 4. Remove baking sheet from oven; drizzle with olive oil, then place flatbreads on top. Spoon tomato sauce evenly onto flatbreads, then scatter chicken mixture on top, followed by mozzarella. Return sheet to oven and bake until flatbreads are crisped and cheese is melted, 8-10 minutes.",
			"STEP 5. Meanwhile, add 1 tablespoon butter to a small microwave-safe bowl. Microwave until just melted, about 30 seconds. Stir in hot sauce, sriracha, and honey until well combined. In another small bowl, mix remaining ranch seasoning with sour cream. Add water 1 teaspoon at a time until you reach a drizzling consistency. Season with salt.",
			"STEP 6. Once flatbreads are finished baking, remove sheet form oven. Transfer flatbreads to a cutting board and slice. Drizzle with buffalo and ranch sauces (or serve ranch on the side for dipping) and serve."
		],
		[
			"CHICKEN SAUSAGE FLATBREADS",
			"CHICKEN",
			"A zesty flat bread dish topped with broiled zucchini and fresh oregano.",
			"1 Zucchini, 1/4 oz Oregano, 1 teaspoon Italian Seasoning, 9 oz Italian Chicken Sausage Mix, 2 Flatbreads, 14 oz Crushed Tomatoes, 1/2 cup Mozzarella Cheese, Table Salt, Pepper, 3 teaspoon Olive Oil",
			"2 Large Baking Sheets, Large Pan, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Oven",
			"STEP 1. Wash and dry all produce. Preheat oven to 500 degrees. Slice zucchini into 1/2-inch-thick rounds. Pick oregano leaves from stems; discard stems. Roughly chop leaves.",
			"STEP 2. Place zucchini on a lightly oiled baking sheet. Season with salt, pepper, and 1/2 teaspoon Italian seasoning (we'll use more later). Place in oven and cook until softened and browned, 5-7 minutes. (TIP: Keep an eye on the zucchini - it can burn.) Remove sheet, then adjust oven temperature to 450 degrees.",
			"STEP 3. Heat a drizzle of olive oil in a large pan over medium-high heat. Add sausage to pan along with half the oregano, breaking up meat into pieces. Cook, tossing, until browned and no longer pink, 4-6 minutes. Remove pan from heat.",
			"STEP 4. Place flatbreads on another lightly oiled baking sheet. Season with salt and pepper. Spread a thin layer of tomatoes across the tops of the flatbreads. Sprinkle with salt, pepper, and 1/2 teaspoon Italian Seasoning (the rest will be used later). Scatter sausage and zucchini over evenly, then follow with mozzarella.",
			"STEP 5. Bake flatbreads in oven until golden brown at edges and cheese melts, 4-6 minutes.",
			"STEP 6. Scatter remaining oregano over flatbreads (to taste), then cut into slices and serve."
		],
		[
			"PRESTO PESTO PANKO CHICKEN",
			"CHICKEN",
			"A savory, herb-laced dish served with roasted potatoes and green salad on the side.",
			"12 oz Yukon Gold Potatoes, 1/2 cup Panko Breadcrumbs, 1/2 cup Mozzarella Cheese, 2 Chicken Breasts, 2 tablespoon Pesto, 1 Lemon, 2 oz Spring Mix Lettuce, Table Salt, Pepper, 5 teaspoon Olive Oil",
			"Basting Brush, 2 Large Baking Sheets, Small Bowl, Large Bowl, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Oven",
			"STEP 1. Wash and dry all produce. Adjust rack to upper position and preheat oven to 450 degrees. Cut potatoes into 1/2-inch cubes.",
			"STEP 2. Toss potatoes on a baking sheet with a drizzle of olive oil and a pinch of salt and pepper. Roast in oven until browned, 20-25 minutes, tossing halfway through.",
			"STEP 3. In a small bowl, mix together panko, mozzarella cheese, a drizzle of olive oil, and a pinch of salt and pepper.",
			"STEP 4. Place chicken on another, lightly oiled baking sheet. Brush 1 tablespoon pesto onto top of one piece. Repeat with the other piece. Cover pesto-brushed sides with crust mixture, pressing to adhere. Roast in oven until chicken is no longer pink in center, about 20 minutes.",
			"STEP 5. Halve lemon. In a large bowl, toss together lettuce, a squeeze or two of lemon, and a large drizzle of olive oil. Season with salt and pepper.",
			"STEP 6. Divide potatoes and chicken between plates. Serve with salad on the side."
		],
		[
			"CREAMY CAJUN CHICKEN SAUSAGE PENNE",
			"CHICKEN",
			"A spicy blending of chicken and pasta. Well worth the time investment.",
			"1 Roma Tomato, 2 Cloves of Garlic, 1 Package of Pene Pasta, 1/2 pound of Chicken Sausage Mix, 1/2 tablespoon of Blackening Spice, 2 tablespoons of Chicken Stock Concentrate, 2 tablespoons of Cream Cheese, Shredded Monterey Jack Cheese, 2 tablespoons of Vegetable Oil, 1 tablespoon of Butter, Table Salt, Black Pepper",
			"Stove-Top, Medium Pot, Cutting Board, Knife, Measuring Cup, Strainer, Large Pan, Wooden Stirring Spoon",
			"STEP 1. Bring a medium pot of salted water to a boil. Wash and dry all produce. Dice tomato. Peel and thinly slice garlic.",
			"STEP 2. Once water is boiling, add pasta to pot. Cook until al dente, 9 – 11 minutes. Reserve 1 cup pasta cooking water, then drain.",
			"STEP 3. Meanwhile, heat a large drizzle of oil in a large pan over medium-high heat. Add sausage and cook, breaking up meat into pieces, until browned and cooked through, 4-6 minutes. Add garlic and blackening spice. Cook, stirring until fragrant, 1 minute.",
			"STEP 4. Stir tomato, stock concentrate, and 1/2 cup reserved pasta cooking water into pan with sausage mixture. Cook until sauce is slightly reduced, 2-3 minutes. Lower heat to medium and stir in cream cheese and 1 tablespoon of butter until melted. Turn off heat.",
			"STEP 5. Add pasta to pan with sauce; stir to thoroughly combine. If sauce is too think, add more reserved pasta cooking water, a splash at a time, until everything is coated in a creamy sauce. Divide between bowls and sprinkle with cheese.",
			null
		],
		[
			"TUSCAN HERBED CHICKEN", 
			"CHICKEN",
			"A combination chicken and pasta dish. It's zesty, creamy, and all-around tasty.", 
			"1 Roma Tomato, 3 Cloves of Garlic, 2 teaspoons of Tuscan Heat Spice, 2 Chicken Breasts, Linguine Pasta, 2 tablespoon of Cream Cheese, 1 cup Shredded Parmesan, 2 tablespoons of Butter, 1 tablespoon of Olive Oil, Table Salt, Pepper", 
			"Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Medium Bowl, Paper Towels, Large Pot, Large Pan", 
			"STEP 1. Bring a large pot of salted water to a boil. Wash and dry all produce. Dice tomato. Peel garlic; thinly slice two cloves and finely chop remaining clove.", 
			"STEP 2. Place chicken in a medium bowl; pat dry with paper towels. Add a large drizzle of olive oil, chopped garlic, half the tuscan heat spice (you'll use the rest later), salt, and pepper; turn chicken to thoroughly coat. Set aside. Once water is boiling, add pasta to pot. Cook until al dente, 9-11 minutes. Reserve 1/2 cup pasta cooking water then drain.", 
			"STEP 3. While pasta cooks, heat a drizzle of olive oil in a large pan over medium heat. Add chicken and cook until browned and cooked through, 6-8 minutes per side (if chicken starts to brown too quickly, lower heat). Turn off heat; transfer chicken to a cutting board. Once cool enough to handle, thinly slice crosswise.", 
			"STEP 4. Melt 2 tablespoons of butter in same pan over medium heat. Add sliced garlic; cook, stirring, until fragrant, 1 minute. Add tomato, remaining tuscan heat spice, salt, and pepper. Cook, stirring, until softened, 2-3 minutes.", 
			"STEP 5. Stir cream cheese, half the parmesan (you'll use the rest later), and half the reserved pasta cooking water into pan with tomato mixture. Bring to a simmer, then stir in drained pasta (if necessary, stir in more reserved pasta cooking water a splash at a time until pasta is coated in a creamy sauce.) Turn off heat; taste and season with salt and pepper.", 
			"STEP 6. Divide pasta mixture between plates. Top with sliced chicken and remaining parmesan."
		],
		[
			"THAI STEAK TACOS",
			"BEEF",
			"A sweet dish topped with pickled cucumbers and garlic sriracha mayo",
			"1/2 pound Diced Steak, 6 Flour Tortillas, 1 Persian Cucumber, 3 oz Carrot, 4 tablespoons Mayonnaise, 1 tablespoon Sriracha, 1 Clove of Garlic, 2 tablespoon Rice Wine Vinegar, 1 bunch of Cilantro, 1 Lime, 2 tablespoon Sweet Soy Glaze, Table Salt, Pepper, 2 teaspoon Vegetable Oil, 1/2 teaspoon Sugar, 1/4 cup Water (for step 5)",
			"Paper Towels, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Peeler, Box Grater, 2 Small Bowls, Large Pan(preferably non-stick), Plate, Microwave, Stove-top",
			"STEP 1. Wash and dry all produce. Halve lime. Trim and halve cucumber lengthwise; thinly slice crosswise into half-moons. Trim, peel, and grate carrot on the largest holes of a box grater. Finely chop cilantro. Peel and grate or finely chop garlic. Pat steak dry with paper towels.",
			"STEP 2. In a small bowl, combine half the vinegar (you'll use the rest later), juice from half the lime, 1/2 teaspoon sugar, and a pinch of salt. Add cucumber and stir to coat. Set aside to quick-pickle.",
			"STEP 3. Heat a drizzle of oil in a large, preferably nonstick, pan over medium-high heat. Add carrot; cook, stirring, until just tender, 1 minute. Season with salt and pepper. Transfer to a plate.",
			"STEP 4. Heat a drizzle of oil in same pan over high heat. Add steak and season with a pinch of salt and pepper. Cook, stirring occasionally, until browned and cooked to desired doneness, 2-3 minutes. Stir in sweet soy glaze and remaining vinegar. Bring to a simmer, then immediately turn off heat. Taste and season with salt and pepper.",
			"STEP 5. In a second small bowl combine mayonnaise, a pinch of garlic, and sriracha to taste. Season with salt. Stir in water 1 teaspoon at a time until mixture reaches a drizzling consistency.",
			"STEP 6. Wrap tortillas in damp paper towels and microwave until warm and pliable, 30 seconds. Divide tortillas between plates; fill with steak, carrot, pickled cucumber, and cilantro. Drizzle with garlic sriracha mayo. Cut remaining lime into wedges and serve on the side."
		],
		[
			"FRENCH ONION MEATLOAVES",
			"BEEF",
			"A savory dish topped with cheesy caramelized onions and served with roasted carrots and potato wedges on the side.",
			"5 Yukon Gold Potatoes, 12 oz Carrots, 1 Yellow Onion, 1 tablespoon Dried Rosemary, 1 Slice of White Bread, 1/2 pound Ground Beef, 1 tablespoon Beef Stock Concentrate, 1/2 cup Shredded Mozzarella Cheese, 3 Cloves of Garlic, Table Salt, Pepper, 1 tablespoon Vegetable Oil, 1 teaspoon Sugar, 2 tablespoon Butter, 2 tablespoon Water(for step 3), 1/4 Cup Water(for step 5)",
			"Oven, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Peeler, 2 Large Baking Sheets, Medium Bowl, Large Pan",
			"STEP 1. Preheat oven to 425 degrees. Wash and dry all produce. Cut potatoes into 1/2-inch-thick wedges. Trim, peel, and cut carrots on a diagonal into 1/4-inch pieces. Halve, peel, and thinly slice onion. Peel and finely chop garlic.",
			"STEP 2. Toss potato wedges on a baking sheet with a drizzle of oil, half the rosemary (you'll use the rest later), salt, and pepper. Roast on top rack until tender, 20-25 minutes.",
			"STEP 3. While potatoes roast, in a medium bowl, soak break with 2 tablespoons of water. Let absorb, then break up with your hands until pasty. Add beef, garlic, remaining rosemary, salt, and pepper; mix to combine. Form into two loaves and place on one side of a second baking sheet.",
			"STEP 4. Toss carrots on opposite side of baking sheet from meatloaves with a drizzle of oil, salt, and pepper. Roast on middle rack for 20 minutes (we'll top the meatloaves then).",
			"STEP 5. Meanwhile, heat a drizzle of oil in a large pan over medium-high heat. Add onion and season with salt and pepper. Cook, stirring, until softened and lightly browned, 8-10 minutes. Add 1/4 cup water, stock concentrate, and 1 teaspoon sugar. Cook, stirring, until onion is caramelized and jammy, 2-3 minutes. Turn off heat and stir in 2 tablespoon of butter. Season with salt and pepper.",
			"STEP 6. Once meatloaves have baked 20 minutes, remove baking sheet from oven and top with caramelized onion and cheese. Return to middle rack until cheese has melted, meatloaves are cooked through, and carrots are tender, 3-5 minutes more. Divide potatoes, carrots, and meatloaves between plates."
		],
		[
			"SWEET 'N' TANGY CHERRY MEATBALLS",
			"BEEF",
			"A tasty meal served with roasted zucchini and garlic mashed potatoes on the side.",
			"5 Yukon Gold Potatoes, 1 Zucchini, 1 Slice of White Bread, 1/2 pound Ground Beef, 1 teaspoon Garlic Powder, 2 tablespoon Cherry Jam, 2 tablespoon Soy Sauce, 2 tablespoon Sour Cream, Table Salt, Pepper, 3 tablespoon Ketchup, 1 teaspoon Vegetable Oil, 1 tablespoon Butter, 2 tablespoon Water(for step 4)",
			"Basting Brush, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Oven, Medium Pot, Strainer, 2 Small Bowls, Medium Bowl, Large Baking Sheet",
			"STEP 1. Preheat oven to 450 degrees. Wash and dry all produce. Dice potatoes into 1/2-inch pieces. Trim and halve zucchini lengthwise; cut crosswise into 1/2-inch-thick half-moons.",
			"STEP 2. Place potatoes in a medium pot with enough salted water to cover by 2 inches. Bring to a boil and cook until very tender, 12-15 minutes. Reserve 1/2 cup potato cooking water, then drain and return potatoes to pot. Keep covered off heat until ready to mash.",
			"STEP 3. While potatoes cook, in a small bowl, combine jam, soy sauce, and 3 tablespoons of ketchup. Season with salt and pepper. Set half the glaze aside in a separate small bowl.",
			"STEP 4. In a medium bowl, soak bread with 2 tablespoons of water; break up with your hands until pasty. Add beef, half the garlic powder (you'll use the rest later), salt, and pepper. Gently combine then form into 1 and 1/2-inch meatballs. Place on one side of a baking sheet. Brush or spoon meatballs with half the cherry glaze.",
			"STEP 5. Toss zucchini on opposite side of sheet from meatballs with a drizzle of oil, salt, and pepper. Roast until meatballs are cooked through and zucchini is browned and tender, 14-16 minutes.",
			"STEP 6. Meanwhile, mash potatoes with sour cream, remaining garlic powder, 1 tablespoon of butter, salt, and pepper. Add a splash or two of reserved potato cooking water as necessary until potatoes are smooth and creamy. Divide mashed potatoes, zucchini, and meatballs between plates. Drizzle meatballs with reserved cherry glaze."
		],
		[
			"HERB BUTTER STEAK",
			"BEEF",
			"A savory dish served with roasted broccoli and cheesy potatoes on the side.",
			"5 Yukon Gold Potatoes, 12 oz Broccoli Florets, 1 Clove of Garlic, 1 Bunch Parsley, 1 tablespoon Dijon Mustard, 2 Ranch Steaks, 1/2 cup Shredded Parmesan Cheese, Table Salt, Pepper, 2 tablespoon Butter, 5 teaspoon Vegetable Oil",
			"Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Oven, Small Bowl, Large Baking Sheet, Paper Towels, Large Pan, Microwave",
			"STEP 1. Preheat oven to 450 degrees. Wash and dry all produce. Place 2 tablespoon butter in a small bowl; set aside to soften. Dice potatoes into 1/2-inch pieces. Cut broccoli florets into bite-sized pieces, if necessary.",
			"STEP 2. Toss potatoes on one side of a baking sheet with a large drizzle of oil, salt, and pepper. Toss broccoli on empty side with a large drizzle of oil, salt, and pepper. Roast until everything is lightly browned and just tender, 15-20 minutes.",
			"STEP 3. While veggies roast, peel and finely chop garlic. Finely chop parsley. If butter is not yet softened, microwave for 5-10 seconds; stir in mustard, half the chopped parsley, and a pinch of garlic.",
			"STEP 4. Pat steak dry with paper towels and season all over with salt and pepper. Heat a drizzle of oil in a large pan over medium-high heat. Add steak and cook to desired doneness, 3-5 minutes per side. Turn off heat; transfer to a cutting board to rest.",
			"STEP 5. Once broccoli is just tender, remove from baking sheet. Give potatoes a toss, then sprinkle with Parmesan. Return to oven until cheese is melted and lightly browned, 5-6 minutes.",
			"STEP 6. Thinly slice steak against the grain. Divide between plates along with roasted broccoli and cheesy potatoes. Dollop steak with herb butter. Garnish with remaining chopped parsley."
		],
		[
			"HOTEL BUTTER STEAK",
			"BEEF",
			"Served with crispy potato rounds and green beans amandine on the side this dish is both zesty and satisfying.",
			"5 Yukon Gold Potatoes, 1 Clove of Garlic, 1 Bunch of Parsley, 2 Ranch Steaks, 1/4 cup Sliced Almonds, 24 oz Green Beans, Table Salt, Pepper, 2 tablespoons Butter, 4 teaspoons Vegetable Oil, 1/4 cup Water",
			"Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Oven, Small Microwave-Safe Bowl, Microwave, Large Baking Sheet, Large Pan with Lid, Paper Towels, Plate",
			"STEP 1. Preheat oven to 450 degrees. Wash and dry all produce. Peel and finely chop garlic. Finely chop parsley. Place 2 tablespoons of butter in a small microwave-safe bowl; microwave until just softened, 5-10 seconds. Stir in 1 teaspoon parsley and a pinch of garlic. Season with salt and pepper.",
			"STEP 2. Cut potatoes into 1/4-inch-thick rounds. Toss on a baking sheet with a large drizzle of oil, salt, and pepper; spread out evenly across entire sheet. Roast until browned and tender, 18-20 minutes.",
			"STEP 3. Meanwhile, heat a large pan over medium-high heat. Add almonds and cook, stirring often, until golden brown and fragrant, 5-6 minutes. Turn off heat; transfer to a plate and set aside to cool.",
			"STEP 4. Pat steak dry with paper towels; season all over with salt and pepper. Heat a large drizzle of oil in pan used for almonds over medium-high heat. Add steak and cook to desired doneness, 3-5 minutes per side. Turn off heat; transfer to a cutting board to rest.",
			"STEP 5. Add green beans to same pan over medium heat. Cook, stirring, until bright green, 2-3 minutes. Pour in 1/4 cup of water and cover pan. Let steam, shaking pan once or twice, until green beans are tender, 3-4 minutes. Uncover and add remaining garlic. Cook, stirring, until fragrant, 30 seconds. Season with salt and pepper.",
			"STEP 6. Thinly slice steak against the grain. Divide sliced steak, green beans, and potatoes between plates. Sprinkle green beans with almonds. Dollop steak with hotel butter. Garnish with remaining parsley."
		],
		[
			"MELTY MONTEREY JACK BURGERS",
			"BEEF",
			"A sweet and zesty burger dish topped with red onion jam and garlic mayo. Served with crispy breaded zucchini",
			"2 Cloves of Garlic, 1 Red Onion, 1 Zucchini, 2 tablespoon Mayonnaise, 5 teaspoon Balsamic Vinegar, 1/4 cup Panko Breadcrumbs, 1 teaspoon Dried Oregano, 10 oz Ground Beef, 1/2 cup Monterey Jack Cheese, 2 Potato Buns, 2 tablespoon Ketchup, Table Salt, Pepper, 1 teaspoon Sugar, 1 tablespoon Vegetable Oil",
			"2 Small Bowls, Large Pan with Lid, Medium Bowl, Large Baking Sheet, Cutting Board, Knife, Wooden Stirring Spoon, Spatula",
			"STEP 1. Adjust rack to top position and preheat oven to 450 degrees. Wash and dry all produce. Mince or grate 1 clove of garlic. Halve, peel, and thinly slice onion. Cut zucchini into 3-inch-long pieces, then halve each piece lengthwise. Cut halves into thin wedges.",
			"STEP 2. In a small bowl, combine mayonnaise and as much garlic as you like (start with a pinch, taste, and add more from there). Season with salt and pepper.",
			"STEP 3. Heat a drizzle of oil in a large pan over medium heat. Add onion and cook, stirring occasionally, until browned and softened, 8-10 minutes. (TIP: If onion starts to brown too quickly, add a splash of water.) Stir in vinegar and 1 teaspoon of sugar. Continue cooking until caramelized and jammy, 1-2 minutes more. Season with salt and pepper. Turn off heat. Transfer to a second small bowl. Wash out pan.",
			"STEP 4. While onion cooks, in a medium bowl, combine zucchini and 1/2 tablespoon garlic mayo until wedges are evenly coated. Add panko breadcrumbs, oregano, and a large pinch of salt and pepper; toss so breadcrumbs stick to zucchini. (It's okay if not all the breadcrumbs stick.) Spread on a lightly oiled baking sheet. Bake, tossing halfway through, until panko is golden brown, about 15 minutes.",
			"STEP 5. Shape beef into two equal-sized patties; season all over with salt and pepper. Heat a drizzle of oil in pan used to cook onion over medium-high heat. Add patties and cook almost to desired doneness, 3-5 minutes per side. Top each patty with cheese. Cover pan to melt cheese and allow patties to finish cooking, about 1 minute.",
			"STEP 6. Halve buns and toast until golden brown. Spread buns with ketchup and garlic mayo (to taste). Fill each with a patty and as much onion jam as you like. Serve with zucchini on the side."
		],
		[
			"BEEF TACO FLATBREADS",
			"BEEF",
			"A spicy and zesty dish topped with poblano, jalapeño peppers, and two kinds of cheese",
			"1 Roma Tomato, 1 Poblano Pepper, 1/4 oz Cilantro, 1 Jalapeño, 10 oz Ground Beef, 1 tablespoon Southwest Spice Blend, 2 Flatbreads, 1/2 cup Mexican Cheese Blend, 1/4 cup Monterey Jack Cheese, 4 tablespoon Sour Cream, 1 teaspoon Hot Sauce, Table Salt, Pepper, 2 teaspoon Vegetable Oil, 1 teaspoon Olive Oil, 1 and 1/2 tablespoon water",
			"Aluminum Foil, Large Baking Sheet, Medium Pan, Small Bowl, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Oven",
			"STEP 1. Wash and dry all produce. Adjust oven rack to middle position and place an aluminum-foil-lined baking sheet inside. Preheat oven to 450 degrees. Finely chop tomato. Core and seed poblano, then cut into 1/4-inch squares. Finely chop cilantro. Slice jalapeño into thin rounds (remove ribs and seeds for less heat).",
			"STEP 2. Heat a drizzle of oil in a medium pan over high heat. Once hot, add poblano and cook, tossing, until lightly charred, 3-4 minutes. Season with salt and pepper. Remove from pan and set aside. Reduce heat under pan to medium high and add another drizzle of oil.",
			"STEP 3. Add beef to same pan and season with plenty of salt and pepper. Cook until browned, 4-5 minutes, while breaking up meat into pieces. Add poblano, tomato, and 2 teaspoons of southwest spice (save the rest for the crema) and toss until well combined. Season with salt and pepper. Remove pan from heat.",
			"STEP 4. While beef cooks, remove baking sheet from oven and place flatbreads on it. Drizzle flatbreads with olive oil and season with salt and pepper. Toast in oven until golden brown and slightly crisp, 2-4 minutes. TIP: Keep an eye out for any burning.",
			"STEP 5. Remove sheet with flatbreads from oven, then sprinkle each flatbread evenly with a layer of beef mixture. Scatter both cheeses over each. Using oven mitts, adjust oven rack to upper position. Return sheet to oven and bake until cheeses melt, about 2 minutes.",
			"STEP 6. In a small bowl, stir together sour cream, remaining Southwest spice, and 1 and 1/2 tablespoon water. Season with salt and pepper. Drizzle mixture over flatbreads. Drizzle hot sauce over to taste. Sprinkle with cilantro and as much jalapeño as you like. Cut into slices and serve."
		],
		[
			"CRUSHED PEPPERCORN STEAK",
			"BEEF",
			"A zesty and savory dish served with creamed kale and potato wedges on the side.",
			"1 Shallot, 4 oz Kale, 12 oz Yukon Gold Potatoes, 1/4 teaspoon Black Peppercorn, 2 Sirloin Steaks, 1 tablespoon Beef Stock Concentrate, 4 tablespoon Sour Cream, Table Salt, Pepper, 1 tablespoon Vegetable Oil, 1 tablespoon Butter, 1/2 cup Water",
			"Large Baking Sheet, Large Pan, Medium Pan, Zip-close Bag, Mallet, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Oven",
			"STEP 1. Wash and dry all produce. Adjust rack to middle position and preheat oven to 400 degrees. Halve, peel, and mince shallot. Remove and discard any stems and large ribs from kale. Cut potatoes into 3/4-inch-thick wedges. Place peppercorns in a zip-close bag and, using a heavy pan or mallt, pound peppercorns until coursley ground.",
			"STEP 2. Toss potatoes on a baking sheet with a drizzle of oil and a pinch of salt and pepper. Roast in over until tender and browned, 30-35 minutes, tossing halfway through.",
			"STEP 3. Meanwhile, melt 1 tablespoon of butter in a large pan over medium heat. Add kale and a splash of water. Cook, tossing occasionally, until leaves are wilted and tender, 4-5 minutes. Season with salt and pepper. Remove from heat, keeping kale in pan.",
			"STEP 4. Heat a drizzle of oil in a medium pan over medium-high heat. Season steak all over with salt and pepper. Add to pan and cook to desired doneness, 4-7 minutes per side. Remove from pan and set aside to rest for a few minutes.",
			"STEP 5. Heat another drizzle of oil in same pan. Add shallot and 1/4 teaspoon ground peppercorns (use more or less to taste). Cook, tossing, until shallot is soft, 2-3 minutes. Stir in stock concentrate and 1/2 cup water, scraping up any browned bits on bottom. Bring to a simmer and let bubble until reduced by half, 2-3 minutes. Remove pan from heat, then stir in half the sour cream.",
			"STEP 6. Return pan with kale to medium heat. When kale is just warmed, remove pan from heat and stir in remaining sour cream. Season with salt and pepper. Slice steak against the grain, then divide between plates along with potatoes and kale. Drizzle steak with sauce and serve."
		],
		[
			"COWBOY SKILLET PIE",
			"BEEF",
			"A filling and hearty blend of meat and veggies",
			"5 Yukon Gold Potatoes, 1 Long Green Pepper, 1 Yellow Onion, 3 Cloves of Garlic, 1 Jalapeño, 1/2 pound of Ground Beef, 1 tablespoon of Southwest Spice, 1 tablespoon of Beef Stock Concentrate, 2 tablespoon Sour Cream, Table Salt, Pepper, 1 tablespoon of Flour, 2 tablespoons of Butter, 1 teaspoon of Vegetable Oil, 1 tablespoon of Ketchup, 1/2 cup of water (or a 1/2 cup of milk if you want extra creamy mashed potatoes)",
			"Cutting Board, Knife, Medium Pot, Medium Ovenproof Pan (or, if you don't have an ovenproof pan, a medium pan and baking dish), Strainer, Measuring Cup, Stove-Top, Broiler, Wooden Stirring Spoon, Spatula",
			"STEP 1. Heat broiler to high. Wash and dry all produce. Dice potatoes into 1/2-inch pieces. Core, deseed, and cut green pepper into a medium dice. Halve, peel, and cut onion into a small dice. Peel and finely chop garlic. Finely chop jalapeño, removing ribs and seeds for less heat.",
			"STEP 2. Place potatoes in a medium pot with enough salted water to cover by 2 inches. Bring to a boil and cook until very tender, 12-15 minutes. Drain and return potatoes to pot. Keep covered off heat.",
			"STEP 3. Meanwhile, heat a drizzle of oil in a medium, preferably ovenproof, pan over medium-high heat. Add green pepper and season with salt and pepper. Cook, stirring occasionally, until softened and lightly browned, 3-4 minutes. Add onion and season with salt and pepper. Cook, stirring, until softened and lightly browned, 4-5 minutes.",
			"STEP 4. Add garlic, southwest spice, and as much jalapeño as you'd like to pan with veggies. Cook, stirring, until fragrant, 30 seconds. Add beef and a pinch of salt and pepper. Cook, breaking up meat into pieces, until beef is browned and cooked through, 4-5 minutes. Sprinkle with 1 tablespoon of flour. Cook, stirring to coat, 1 minute.",
			"STEP 5. Gradually stir 1/2 cup water, stock concentrate, and 1 tablespoon of ketchup into pan with beef mixture. Simmer until thickened, 1-2 minutes. Taste and season with salt and pepper. Turn off heat. (if your pan isn't ovenproof, transfer mixture to a baking dish.)",
			"STEP 6. Mash potatoes with sour cream and 2 tablespoons of butter. Add splashes of water (or milk for extra creaminess) as necessary until smooth. Season with salt and pepper. Spread mashed potatoes on top of beef mixture, leaving a 1-inch gap around edge of skillet. Broil until bubbling, 3-4 minutes. (Watch carefully, the broiler is a powerful tool). Sprinkle with any remaining jalapeño to taste. Divide between plates and serve"
		],
		[
			"CRISPY PARM FRICO BURGERS",
			"BEEF",
			"A burger topped with caramelized onion and parmesan frico. Wedges on the side make this a basic staple for any barbecue.",
			"5 Yukon Gold Potatoes, 1 Yellow Onion, 2 Buns, 1/2 pound of Ground Beef, 2 tablespoons of Soy Sauce, 1/2 cup Shredded Parmesan Cheese, 1 Clove of Garlic, 1 tablespoon of Vegetable Oil, 1 teaspoon of Sugar, 1 tablespoon of Butter, Table Salt, Pepper, 1/4 cup Water, optionally Ketchup for dipping sauce and burger topping.",
			"Oven, Stove, Microwave, Large Pan, Cutting Board, Knife, Wooden Stirring Spoon, Spatula, Small Microwave-Safe Bowl",
			"STEP 1. Preheat oven to 450 degrees. Wash and dry all produce. Cut potatoes into 1/2-inch-thick wedges. Halve, peel, and thinly slice onion. Peel and finely chop garlic. Halve buns. Toss potatoes on a baking sheet with a drizzle of oil, salt, and pepper. Roast until lightly browned, 15-18 minutes (you'll add more to the baking sheet then).", 
			"STEP 2. While potatoes roast, heat a drizzle of oil in a large pan over medium-high heat. Add onion and season with salt and pepper. Cook, stirring, until softened and lightly browned, 8-10 minutes.", 
			"STEP 3. Meanwhile, form beef into two patties, each about 1/2 inch thick; season all over with salt and pepper. Set aside. Place 1 tablespoon of butter and garlic in a small microwave-safe bowl; microwave for 30 seconds. Brush onto cut sides of buns.", 
			"STEP 4. Once onion is softened, add soy sauce, 1/4 cup water, and 1 teaspoon of sugar. Cook, stirring, until onion is caramelized and jammy, 2-3 minutes. Turn off heat; transfer to a second small bowl, and set aside. Wash out pan.", 
			"STEP 5. Once potatoes are lightly browned, remove sheet from oven; push potatoes to one side. Mound parmesan on empty side in two even piles, each about the width of a burger bun. Place buns cut sides up on a separate sheet or directly on oven rack. Roast until cheese is melted and crispy at edges, potatoes are tender, and buns are golden brown, 5-6 minutes. Immediately transfer parmesan frico to a plate to cool.", 
			"STEP 6. Meanwhile, heat a drizzle of oil in pan used for onion over medium-high heat. Add patties and cook to desired doneness, 3-5 minutes per side. Divide buns between plates and fill with patties, caramelized onion, and parmesan frico. Serve with potato wedges on the side. If you've got some ketchup spread top buns with it and serve a bit of it on the side for dipping."
		]	
	]
}
